{
  "backend/main.mo": "Actor defines user profiles, reports, journaling, and squads with authorization checks and in‑memory Map storage.",
  "feature_evidence.json": "Feature evidence describing addition of a Schedule Today section linking to a Google Form and mapping it to DailyDashboard.tsx.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files covering routing, onboarding, layouts, content, pages, utilities, and styling.",
  "frontend/index.css": "Tailwind base and theme setup defining OKLCH color tokens, dark mode variables, and global background/foreground styling.",
  "frontend/index.html": "Basic HTML entry point loading the React app root and main.tsx with favicon and viewport metadata.",
  "frontend/src/App.tsx": "Main app router configuring all pages, query client, root layout, and error boundaries for the application.",
  "frontend/src/components/assessments/AssessmentQuestionnaire.tsx": "Mobile‑friendly assessment questionnaire with progress tracking, radio‑based answers, back/next navigation, and completion callback.",
  "frontend/src/components/assessments/OutcomeBriefingCards.tsx": "Renders assessment outcomes as cards with sections for measurement, relevance, and multiple insight types including interactive scenarios.",
  "frontend/src/components/branding/BrandHeaderBanner.tsx": "Displays a branded header banner with emblem, title, optional subtext, and a textured gradient background.",
  "frontend/src/components/dashboard/CoachActionsCard.tsx": "Generates and displays prioritized coaching actions based on the latest daily input and readiness calculations.",
  "frontend/src/components/dashboard/DailyLoggingPanel.tsx": "Provides sliders for logging daily readiness factors with optional guidance and submits collected data.",
  "frontend/src/components/dashboard/GamificationCard.tsx": "Shows performance tier, streaks, and earned badges based on user inputs and activity streak.",
  "frontend/src/components/dashboard/ReadinessMeter.tsx": "Displays overall readiness score, factor breakdown, streak info, and analysis for the latest logged data.",
  "frontend/src/components/fieldMode/FieldModeToggle.tsx": "Simple toggle to enable or disable Field Mode using a switch control.",
  "frontend/src/components/izof/AfterTaskReflectionForm.tsx": "Form for submitting post-task performance outcome and reflection, updating an existing IZOF entry.",
  "frontend/src/components/izof/CoachViewPanel.tsx": "Coach-facing summary panel showing weekly stress averages, in-zone frequency, and aggregated emotion counts.",
  "frontend/src/components/izof/CrossFactorInsightsCard.tsx": "Displays combined insights from IZOF entries, daily inputs, and sleep logs, along with missing data prompts.",
  "frontend/src/components/izof/DailyZoneCheckForm.tsx": "Form to create a Daily Zone Check entry with stress rating, emotions, and task type, producing an immediate recommendation.",
  "frontend/src/components/izof/RegulationDecisionHelper.tsx": "Interactive tool showing IZOF stress state and recommendations based on current stress slider input.",
  "frontend/src/components/izof/StressOutcomeCorrelation.tsx": "Shows correlation metrics comparing stress levels and performance outcomes when enough data is available.",
  "frontend/src/components/izof/StressTrendChart.tsx": "Renders an SVG line chart visualizing stress ratings over time with markers for high-performance outcomes.",
  "frontend/src/components/journal/JournalEditor.tsx": "Provides a form UI to create, edit, save, and delete local journal entries with validation and toast notifications.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application shell with navigation, sidebar state management, user identity handling, and responsive layout logic.",
  "frontend/src/components/layout/PageScaffold.tsx": "Wraps pages with consistent spacing, optional title/description, and layout constraints.",
  "frontend/src/components/mentalPerformance/MotivationalVideoCard.tsx": "Empty placeholder file for a motivational video card component.",
  "frontend/src/components/mentalPerformance/YouTubePlayerDialog.tsx": "Empty placeholder file for a YouTube player dialog component.",
  "frontend/src/components/missions/MissionCard.tsx": "Renders a mission card showing title, briefing, lock status, rewards, and assessment-based unlock logic.",
  "frontend/src/components/missions/MissionDebrief.tsx": "Displays mission results including pass/fail, score, XP, win conditions, timed performance, and action buttons.",
  "frontend/src/components/missions/MissionRunner.tsx": "Runs mission steps, handles scoring, timed steps, and produces the final MissionResult.",
  "frontend/src/components/missions/OperatorProgressPanel.tsx": "Shows operator rank, XP progress, and unlocked items using mission progression data.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Onboarding form that collects optional profile info and required disclaimer and guideline acceptance before saving to local profile.",
  "frontend/src/components/reports/PersonalReportEditor.tsx": "Dialog for creating, editing, and submitting personal reports with metadata and XP calculation.",
  "frontend/src/components/reports/ReportDialog.tsx": "Dialog allowing users to submit abuse reports with a reason and optional details via mutation hook.",
  "frontend/src/components/SoldierConnect/FlagReportDialog.tsx": "Dialog component allowing users to locally flag SoldierConnect content with a reason and optional notes.",
  "frontend/src/components/SoldierConnect/ReactionBar.tsx": "Reaction bar for SoldierConnect items showing counts and enabling four reaction types with optional compact mode.",
  "frontend/src/components/system/AppStartupErrorState.tsx": "Full‑screen error state with retry option for app startup failures.",
  "frontend/src/components/system/InitWarningBanner.tsx": "Banner that displays initialization warnings when present.",
  "frontend/src/components/system/RouteErrorBoundary.tsx": "React error boundary that shows a startup error UI and allows retry by reloading the page.",
  "frontend/src/components/tools/MilitaryAppDetailsDialog.tsx": "Dialog displaying full details, usage guidance, tags, and download links for a selected military app.",
  "frontend/src/content/assessmentOutcomes.ts": "Static content mapping assessment outcome IDs to explanations, relevance, and scenario-based insights.",
  "frontend/src/content/assessments.ts": "Defines assessment metadata and question sets for personality and resilience questionnaires, including scoring keys and short descriptions.",
  "frontend/src/content/assessments/README.md": "Documentation describing assessment flow, data structures, scoring logic, and how to extend questions and outcomes.",
  "frontend/src/content/dailyFactorGuidance.ts": "Provides guidance objects for daily self-ratings with polarity rules and detailed 0–100 anchor descriptions.",
  "frontend/src/content/dailyQuotes.ts": "Stores motivational quote data with authors, categories, annotations, and auto-generated IDs.",
  "frontend/src/content/disclaimer.ts": "Contains the app’s legal disclaimer text regarding non-affiliation with the U.S. Army and OPSEC responsibility.",
  "frontend/src/content/izofEducation.ts": "Provides educational content explaining IZOF, stress types, individuality, and real-world performance examples.",
  "frontend/src/content/izofRegulationSkills.ts": "Defines techniques for increasing or decreasing arousal to help users regulate stress levels.",
  "frontend/src/content/leaderGuidance.ts": "Defines interfaces and a dataset of leader guidance tied to assessment outcomes, detailing team roles, communication, friction points, and coaching strategies.",
  "frontend/src/content/mentalPerformance/freeSoldierApps.ts": "Provides structured content for free soldier apps including Libby instructions and app cards with usage guidance, links, and tags.",
  "frontend/src/content/mentalPerformance/lifeLessonsDisplayName.ts": "Empty file with no content.",
  "frontend/src/content/mentalPerformance/motivationalLifeLessonsVideos.ts": "Empty file with no content.",
  "frontend/src/content/mentalPerformance/recommendedReading.ts": "Defines book content structure, a Libby how‑to guide, and a curated reading list focused on leadership, resilience, and mental performance.",
  "frontend/src/content/modules.ts": "Contains mission definitions with briefings, decisions, timed scenarios, win conditions, XP rewards, side quests, and reflection prompts.",
  "frontend/src/content/sleepPerformanceCopy.ts": "Provides sleep performance copy including dashboard text, mode descriptions, educational tiles, and downshift routines.",
  "frontend/src/content/tools/militaryApps.ts": "Defines a static dataset of military-related mobile apps with metadata such as usage, download links, and tags.",
  "frontend/src/contexts/DashboardRefreshContext.tsx": "Provides a React context for triggering dashboard refreshes using an incrementing token.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAssessments.ts": "Manages local assessment storage, history, trends, and unlock helpers using localStorage.",
  "frontend/src/hooks/useDashboard.ts": "Handles daily readiness input processing, score calculation, streak logic, and local storage updates.",
  "frontend/src/hooks/useFieldMode.ts": "Stores and toggles a local 'field mode' boolean in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication, identity persistence, and login state management via a React provider.",
  "frontend/src/hooks/useIsMobile.ts": "Detects whether the viewport width is under a specified breakpoint to support responsive behavior.",
  "frontend/src/hooks/useIzof.ts": "Manages IZOF daily entries, recommendations, and updates tied to a local profile.",
  "frontend/src/hooks/useIzofSettings.ts": "Loads and updates IZOF settings such as coach view and range overrides for the local profile.",
  "frontend/src/hooks/useLifeLessonsProgress.ts": "Empty or placeholder file with no implemented logic.",
  "frontend/src/hooks/useLocalData.ts": "Provides React hooks for local journals, daily inputs, and readiness state tied to the current profile UUID.",
  "frontend/src/hooks/useLocalProfile.ts": "Manages the device-scoped local profile with storage syncing and update/reset helpers.",
  "frontend/src/hooks/useLocalReports.ts": "Handles CRUD, submission, and XP application for locally stored personal reports.",
  "frontend/src/hooks/useMissionProgression.ts": "Manages XP, rank, unlockables, and mission history using localStorage per profile UUID.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using window events.",
  "frontend/src/hooks/useQueries.ts": "Wraps React Query for local-only and backend-dependent operations with graceful degradation.",
  "frontend/src/hooks/useQuoteReflections.ts": "Loads and saves per-quote user reflections scoped to the local profile.",
  "frontend/src/hooks/useReadingProgress.ts": "Tracks per-book reading state and timestamps in localStorage by profile UUID.",
  "frontend/src/hooks/useReadingRewards.ts": "Grants reading-based XP and badges with deduplication and mission progression integration.",
  "frontend/src/hooks/useSafeActor.ts": "Creates and caches a backend actor tied to Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useSleepPerformance.ts": "Manages local sleep and caffeine logs, updates performance state, and computes sleep-related metrics.",
  "frontend/src/hooks/useSoldierConnect.ts": "Handles Soldier Connect data, including threads, stories, challenges, notifications, and XP, with local persistence.",
  "frontend/src/index.css": "Defines global Tailwind layers, color variables, layout rules, and utility classes for themes and responsiveness.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminReports.tsx": "Displays and manages backend abuse reports, supporting status updates and handling offline fallback.",
  "frontend/src/pages/AssessmentHistory.tsx": "Shows assessment history and trends with tabbed navigation and local assessment data.",
  "frontend/src/pages/AssessmentLeaderView.tsx": "Displays leader-focused guidance for completed assessments, pulling latest results and showing team role insights.",
  "frontend/src/pages/AssessmentResults.tsx": "Shows detailed results for a completed assessment, including scores, outcome content, and reward notifications.",
  "frontend/src/pages/AssessmentRun.tsx": "Runs an assessment questionnaire, scores answers, saves results, applies rewards, and navigates to the results page.",
  "frontend/src/pages/Assessments.tsx": "Main entry for the assessments module, listing available assessments, progress, and navigation to history and leader view.",
  "frontend/src/pages/DailyDashboard.tsx": "Daily readiness dashboard showing input logging, readiness metrics, coach actions, and scheduling link with offline support.",
  "frontend/src/pages/DailyQuotes.tsx": "Displays the daily motivational quote and allows users to write and save personal reflections locally.",
  "frontend/src/pages/FreeSoldierApps.tsx": "Renders a filterable list of free mental‑health apps with expandable cards and a Libby DoD guide.",
  "frontend/src/pages/Groups.tsx": "Provides UI to view, create, and join squad groups using dialogs and backend mutations.",
  "frontend/src/pages/GroupSharedEntries.tsx": "Displays a squad’s shared reflection entries with member data and controls for copying, rotating, or leaving the group.",
  "frontend/src/pages/Guidelines.tsx": "Fetches and displays community guidelines with loading handling and styled content.",
  "frontend/src/pages/IZOF.tsx": "Main IZOF hub offering links to zone checks, education, skills, dashboard, and a coach‑view toggle.",
  "frontend/src/pages/IZOFDailyZoneCheck.tsx": "Handles the daily zone check flow, showing existing entries, creating new ones, and adding after‑task reflections.",
  "frontend/src/pages/IZOFEducation.tsx": "Displays IZOF education content using multiple cards populated from static content.",
  "frontend/src/pages/IZOFRegulationSkills.tsx": "Shows arousal regulation techniques and a decision helper, with content sourced from REGULATION_SKILLS.",
  "frontend/src/pages/IZOFStressReadinessDashboard.tsx": "Provides a dashboard with stress trends, IZOF range estimates, correlations, and pattern detection based on user entries.",
  "frontend/src/pages/Journal.tsx": "Local journal page enabling creation, editing, and viewing of private entries with optional prefill.",
  "frontend/src/pages/LifeLessonsRemoved.tsx": "Informs users that the Life Lessons section was removed and links to alternative resources.",
  "frontend/src/pages/MentalPerformanceReading.tsx": "Renders a recommended reading list with progress tracking, collapsible book details, and reward badges.",
  "frontend/src/pages/MilitaryApps.tsx": "Lists military-related apps with search, tag filtering, and a dialog for detailed app information.",
  "frontend/src/pages/MissionRun.tsx": "Runs a mission by ID, handles mission progression, and shows either the interactive runner or debrief.",
  "frontend/src/pages/Modules.tsx": "Displays missions grouped by category with tabs and operator progression, allowing users to start missions.",
  "frontend/src/pages/MotivationalLifeLessons.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/PublicLanding.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/Reports.tsx": "Manages creation, editing, and deletion of personal reports and displays them sorted by timestamp.",
  "frontend/src/pages/SettingsAbout.tsx": "Provides profile editing, device info display, and local data reset functionality.",
  "frontend/src/pages/SleepPerformanceAction.tsx": "Shows tactical sleep guidance, caffeine logging, and personalized recommendations based on sleep state.",
  "frontend/src/pages/SleepPerformanceAnalysis.tsx": "Analyzes sleep debt and maps it to performance impacts with visual indicators and explanations.",
  "frontend/src/pages/SleepPerformanceCheckIn.tsx": "Form page for logging sleep times, quality, pain, and stress inputs, then saving via logSleep and navigating to analysis.",
  "frontend/src/pages/SleepPerformanceDashboard.tsx": "Dashboard displaying sleep logs, debt, readiness, and risk metrics with navigation to related views.",
  "frontend/src/pages/SoldierConnect/SoldierConnectHome.tsx": "Home hub for Soldier Connect showing sections like discussions, stories, mentorship, and notifications with counts and navigation.",
  "frontend/src/pages/SoldierConnect/SoldierConnectLayout.tsx": "Layout wrapper providing navigation tabs and routing for Soldier Connect subpages.",
  "frontend/src/pages/Squads.tsx": "Empty placeholder file for squads page.",
  "frontend/src/pages/SquadSharedEntries.tsx": "Empty placeholder file for squad shared entries page.",
  "frontend/src/types/assessments.ts": "Type definitions for assessments, including questions, outcomes, scoring, and stored results.",
  "frontend/src/types/izof.ts": "Type definitions for IZOF stress zone tracking, entries, and user settings.",
  "frontend/src/types/legacy.ts": "Legacy type definitions for journaling, groups, reports, IZOF entries, and personal reports.",
  "frontend/src/types/mentalPerformance.ts": "Type definitions for mental performance app content, tags, guides, and downloadable app metadata.",
  "frontend/src/types/militaryApps.ts": "Type definitions for military app metadata, tags, and download links.",
  "frontend/src/types/missions.ts": "Type definitions for mission structures, steps, unlock rules, results, and rank progression utilities.",
  "frontend/src/types/motivationalVideos.ts": "Empty placeholder file for motivational video types.",
  "frontend/src/types/personalReports.ts": "Defines types for personal reports, including report fields, metadata, and input shapes for creating or updating reports.",
  "frontend/src/types/soldierConnect.ts": "Contains all Soldier Connect data models such as threads, replies, stories, mentor notes, challenges, reactions, flags, notifications, and state.",
  "frontend/src/utils/assessmentScoring.ts": "Implements scoring logic for dimensional, type-based, and band assessments, producing outcome IDs, labels, and score maps.",
  "frontend/src/utils/backendError.ts": "Maps backend error messages to simplified user-facing messages and actions, handling offline, capacity, permission, validation, and network issues.",
  "frontend/src/utils/dailyRotation.ts": "Generates a deterministic daily index by hashing the current date and mapping it to a dataset length.",
  "frontend/src/utils/inviteCode.ts": "Normalizes invite codes by trimming whitespace only.",
  "frontend/src/utils/izofAnalytics.ts": "Provides stress analytics including trend extraction, correlation summaries, pattern detection, weekly averages, and zone frequency helpers.",
  "frontend/src/utils/izofIntegration.ts": "Generates cross-factor insights by combining IZOF stress data with sleep and training inputs, also identifying missing data.",
  "frontend/src/utils/izofLogic.ts": "Implements IZOF range estimation, stress-zone recommendations, stress-state categorization, and validation for Daily Zone Check inputs.",
  "frontend/src/utils/localDataStore.ts": "Defines device-local data types and localStorage CRUD helpers for journals, readiness inputs, sleep logs, caffeine logs, IZOF data, and reports.",
  "frontend/src/utils/localProfileStorage.ts": "Manages device-local profile data with UUID generation, loading, saving, updating, and reset utilities.",
  "frontend/src/utils/militaryAppsFilter.ts": "Provides keyword and tag-based filtering for Military Apps datasets.",
  "frontend/src/utils/quoteId.ts": "Generates deterministic quote IDs using a simple hash of quote and author.",
  "frontend/src/utils/readinessSemantics.ts": "Maps factor scores to readiness-friendly values, color classes, and explanation bands based on polarity.",
  "frontend/src/utils/reportXp.ts": "Computes deterministic XP for report text based on length thresholds.",
  "frontend/src/utils/sleepPerformance.ts": "Computes sleep debt and related performance metrics, formats sleep windows, estimates caffeine clearance, and provides pain/stress guidance.",
  "frontend/src/utils/soldierConnectDeepLinks.ts": "Builds and parses deep links for Soldier Connect threads and stories with optional prefilled fields.",
  "frontend/src/utils/soldierConnectNotifications.ts": "Creates Soldier Connect notifications for replies, weekly highlights, mentor notes, and challenge reminders.",
  "frontend/src/utils/soldierConnectStore.ts": "Handles localStorage persistence and CRUD operations for Soldier Connect threads, stories, replies, reactions, flags, and notifications.",
  "frontend/src/utils/soldierConnectXp.ts": "Defines XP constants and helper functions for calculating XP for Soldier Connect actions.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/validateMotivationalVideos.ts": "Empty placeholder file for motivational video validation utilities.",
  "frontend/src/utils/youtubeId.ts": "Extracts YouTube video IDs from various URL formats and validates or generates search URLs.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Stores project metadata, feature requests, and current state for app development tracking."
}