{
  "backend/main.mo": "Backend actor defining user profiles, journaling entries, squad groups, reports, and authorization helpers using Motoko maps and counters.",
  "feature_evidence.json": "Feature evidence document describing a UI update to normalize invite codes in onboarding.",
  "frontend-file-summaries.txt": "Aggregated text summaries of major frontend files and their responsibilities.",
  "frontend/index.css": "Tailwind base layer defining global OKLCH color tokens and dark-mode variables.",
  "frontend/index.html": "Basic HTML shell loading the React app with favicon and root mount point.",
  "frontend/src/App.tsx": "Main React app setting up authentication-aware routing, onboarding checks, and theme provider.",
  "frontend/src/components/journal/JournalEditor.tsx": "Journal editor component handling create, edit, delete, sharing, and squad selection logic.",
  "frontend/src/components/layout/AppShell.tsx": "Authenticated app layout with navigation, mobile menu, user dropdown, and logout handling.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Handles invite-code onboarding and disclaimer acceptance with form steps and related mutations.",
  "frontend/src/components/reports/ReportDialog.tsx": "Provides a dialog for submitting abuse reports with reason selection, optional details, and mutation handling.",
  "frontend/src/content/disclaimer.ts": "Exports the static disclaimer text shown during onboarding.",
  "frontend/src/content/modules.ts": "Defines module-related interfaces and exports an array of structured training modules with content and prompts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, storing identity state and exposing login/clear functions via context.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, invites, disclaimers, journaling, and reports using the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables inspired by a red-accent DAGGER theme.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminReports.tsx": "Displays an admin-only interface to review, sort, and update user reports with status controls.",
  "frontend/src/pages/Guidelines.tsx": "Fetches and displays community guidelines in a styled card layout.",
  "frontend/src/pages/Journal.tsx": "Manages creation, editing, and listing of personal journal entries, including squad-shared visibility.",
  "frontend/src/pages/Modules.tsx": "Shows categorized learning modules with content sections and allows starting reflections that prefill journal entries.",
  "frontend/src/pages/PublicLanding.tsx": "Public landing page describing the platform and providing Internet Identity login with disclaimer and feature overview.",
  "frontend/src/pages/SettingsAbout.tsx": "Displays user profile details, disclaimer text, and app information using data from user queries.",
  "frontend/src/pages/Squads.tsx": "Lists the user’s squads and provides dialogs to create or join squads via invite codes.",
  "frontend/src/pages/SquadSharedEntries.tsx": "Shows a squad’s shared journal entries, member details, invite code actions, and leave/report workflows.",
  "frontend/src/utils/inviteCode.ts": "Trims whitespace from invite codes before use.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, plugins, and design tokens.",
  "project_state.json": "Metadata describing project state, features, and system capabilities."
}