{
  "backend/main.mo": "Motoko canister defining user profiles, journaling, squad groups, reports, and access control utilities with state maps and helper checks.",
  "backend/migration.mo": "No-op migration module returning old state as new state.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend source files.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light/dark themes.",
  "frontend/index.html": "HTML entry page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring authentication, onboarding flow, routing, and theme provider.",
  "frontend/src/components/journal/JournalEditor.tsx": "Editor component for creating, updating, sharing, and deleting journal entries.",
  "frontend/src/components/layout/AppShell.tsx": "Authenticated app layout with navigation, user menu, mobile sheet, and route outlet.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Implements a two-step onboarding flow handling invite submission and disclaimer acceptance with error messaging and mutations.",
  "frontend/src/components/reports/ReportDialog.tsx": "Provides a dialog for submitting abuse reports with selectable reasons, optional details, and mutation handling.",
  "frontend/src/content/disclaimer.ts": "Exports the application's full disclaimer text about its unofficial status and user responsibilities.",
  "frontend/src/content/modules.ts": "Defines module-related interfaces and exports structured training modules with content and prompts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication state and actions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend user profiles, invites, disclaimers, journaling, and other mutations.",
  "frontend/src/index.css": "Configures Tailwind base layers and defines extensive light/dark theme CSS variables for colors and layout.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with react-query and Internet Identity providers.",
  "frontend/src/pages/AdminReports.tsx": "Displays and manages community reports for admins, including status updates and sorted report listings.",
  "frontend/src/pages/Guidelines.tsx": "Fetches and displays community guidelines with a loading state and styled content.",
  "frontend/src/pages/Journal.tsx": "Handles viewing, creating, and editing personal journal entries with optional prefilled content.",
  "frontend/src/pages/Modules.tsx": "Shows learning modules filtered by category and allows navigating to create journal reflections.",
  "frontend/src/pages/PublicLanding.tsx": "Public landing page with platform overview, disclaimer, feature cards, and Internet Identity login.",
  "frontend/src/pages/SettingsAbout.tsx": "Renders the Settings & About page showing user profile details, disclaimer text, and app information sections.",
  "frontend/src/pages/Squads.tsx": "Shows the user’s squads and provides dialogs for creating or joining squads via invite codes.",
  "frontend/src/pages/SquadSharedEntries.tsx": "Displays a squad’s shared journal entries, member list, invite-code management, and leave/report actions.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, plugins, and content paths.",
  "project_state.json": "Describes the project’s current state, features, and architecture for the invite‑only IC‑based journaling app."
}