{
  "backend/main.mo": "Defines core actor logic including user profiles, journaling, squads, reports, and authorization helpers using map-backed state and access control checks.",
  "feature_evidence.json": "Feature evidence manifest listing feature IDs, descriptions, related files, components, tests, and confidence levels for recent app behavior changes.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files describing UI flows, modules, hooks, styling, and component responsibilities.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light and dark themes and applying global background, text, and border styles.",
  "frontend/index.html": "Root HTML file mounting the React app and loading the main TypeScript entrypoint with DAGGER branding metadata.",
  "frontend/src/App.tsx": "Main application component handling Internet Identity login, safe actor initialization, profile loading, onboarding, and route structure with error states.",
  "frontend/src/components/journal/JournalEditor.tsx": "Journal entry editor enabling create, update, delete, and group‑sharing actions with validation, squad selection, and mutation‑based persistence.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with navigation, user menu, mobile menu, and logout handling.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Implements a two-step onboarding flow for user registration and disclaimer acceptance with validation and error handling.",
  "frontend/src/components/reports/ReportDialog.tsx": "Provides a dialog for submitting abuse reports with reason selection, optional details, and mutation handling.",
  "frontend/src/components/system/AppStartupErrorState.tsx": "Displays a full‑screen error state with retry support for startup failures.",
  "frontend/src/content/disclaimer.ts": "Exports the application's disclaimer text as a constant string.",
  "frontend/src/content/modules.ts": "Defines module-related interfaces and exports a list of training modules with quotes, interpretations, and prompts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, logout, identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, journaling, squads, and reports, wrapping backend actor calls with caching and mutations.",
  "frontend/src/hooks/useSafeActor.ts": "Creates and manages a backend actor tied to the user's identity, handling initialization, access control, and query invalidation.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines light/dark theme CSS variables with a red‑accent DAGGER-inspired palette.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and loads global CSS.",
  "frontend/src/pages/AdminReports.tsx": "Admin page for viewing, sorting, and updating report statuses, with permission checks and UI feedback.",
  "frontend/src/pages/Groups.tsx": "Shows the user's squads and provides dialogs for creating or joining groups with client-side validation and mutations.",
  "frontend/src/pages/GroupSharedEntries.tsx": "Displays a squad group's shared entries, members, and actions like copying invite codes, rotating codes, leaving, and reporting entries.",
  "frontend/src/pages/Guidelines.tsx": "Displays community guidelines with loading state and static content inside a card.",
  "frontend/src/pages/Journal.tsx": "Manages viewing, creating, and editing journal entries with search-prefill and squad info.",
  "frontend/src/pages/Modules.tsx": "Shows learning modules filtered by category and allows starting a journal reflection with prefilled content.",
  "frontend/src/pages/PublicLanding.tsx": "Public landing page with app overview, disclaimer, feature cards, and Internet Identity login.",
  "frontend/src/pages/SettingsAbout.tsx": "Settings page displaying user profile, disclaimer text, and app information sections.",
  "frontend/src/pages/Squads.tsx": "Empty placeholder file for squads page.",
  "frontend/src/pages/SquadSharedEntries.tsx": "Empty placeholder file for squad shared entries.",
  "frontend/src/utils/inviteCode.ts": "Normalizes invite codes by trimming whitespace.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom theming (colors, fonts, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the app’s purpose and listing implemented features including authentication, access control, onboarding, journaling, and moderation."
}