{
  "backend/main.mo": "Motoko canister implementing user profiles, daily inputs, journaling, squad groups, and abuse reporting with access‑controlled query and update methods.",
  "feature_evidence.json": "Defines feature evidence metadata linking features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Aggregated high‑level descriptions of numerous frontend files, covering routing, UI components, onboarding, guidelines, missions, and admin features.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme OKLCH color tokens and global layout defaults.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, root mount node, and loading the main React script.",
  "frontend/src/App.tsx": "Top‑level React router and query‑client setup wiring all major app routes through the AppShell layout and error boundaries.",
  "frontend/src/components/assessments/AssessmentQuestionnaire.tsx": "Interactive questionnaire component with progress tracking, navigation, and answer validation that submits collected responses.",
  "frontend/src/components/assessments/OutcomeBriefingCards.tsx": "Displays assessment outcome content in cards, including text, briefing alerts, and interactive scenario choices.",
  "frontend/src/components/branding/BrandHeaderBanner.tsx": "Renders a branded header banner with emblem, title, and optional subtext for the Dagger Brigade H2F app.",
  "frontend/src/components/dashboard/CoachActionsCard.tsx": "Generates and displays prioritized coaching actions based on the latest daily input and readiness thresholds.",
  "frontend/src/components/dashboard/DailyLoggingPanel.tsx": "Daily input form with sliders for key readiness factors and optional guidance, submitting values for processing.",
  "frontend/src/components/dashboard/GamificationCard.tsx": "Shows performance tier, streak status, and earned badges based on user streaks and latest overall score.",
  "frontend/src/components/dashboard/ReadinessMeter.tsx": "Displays overall readiness score, factor breakdowns, streaks, and optional analysis text using progress bars and color tiers.",
  "frontend/src/components/fieldMode/FieldModeToggle.tsx": "Toggle switch that enables or disables Field Mode using a custom hook.",
  "frontend/src/components/izof/AfterTaskReflectionForm.tsx": "Form for recording performance outcome and reflection, updating an IZOF entry on submit.",
  "frontend/src/components/izof/CoachViewPanel.tsx": "Coach-facing summary showing weekly averages, in‑zone frequency, and emotion category counts derived from IZOF entries.",
  "frontend/src/components/izof/CrossFactorInsightsCard.tsx": "Generates and displays cross‑factor insights from IZOF entries, daily inputs, and sleep data, including missing‑data prompts.",
  "frontend/src/components/izof/DailyZoneCheckForm.tsx": "Form to capture stress rating, emotions, and upcoming task, validating inputs and generating an IZOF recommendation.",
  "frontend/src/components/izof/RegulationDecisionHelper.tsx": "Interactive slider that categorizes current stress level relative to estimated IZOF range and provides regulation guidance.",
  "frontend/src/components/izof/StressOutcomeCorrelation.tsx": "Shows computed correlation between stress levels and performance outcomes, or prompts for more data if insufficient.",
  "frontend/src/components/izof/StressTrendChart.tsx": "Renders an SVG line chart of stress ratings over time with labeled axes and color-coded data points.",
  "frontend/src/components/journal/JournalEditor.tsx": "Provides a form to create, edit, or delete local journal entries with save validation and confirmation dialogs.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application layout with sidebar navigation, user profile controls, and responsive behavior.",
  "frontend/src/components/layout/PageScaffold.tsx": "Wraps page content with optional title, description, actions, and configurable max-width styling.",
  "frontend/src/components/mentalPerformance/MotivationalVideoCard.tsx": "Empty file.",
  "frontend/src/components/mentalPerformance/YouTubePlayerDialog.tsx": "Empty file.",
  "frontend/src/components/missions/MissionCard.tsx": "Displays a mission card with title, briefing, unlock rules, win conditions, XP rewards, and completion status.",
  "frontend/src/components/missions/MissionDebrief.tsx": "Shows mission results including pass/fail status, score, XP earned, win condition outcomes, and optional reflection action.",
  "frontend/src/components/missions/MissionRunner.tsx": "Runs mission steps, tracks choices and scoring, handles timed steps, and outputs a final mission result.",
  "frontend/src/components/missions/OperatorProgressPanel.tsx": "Shows operator rank, XP progress, and unlocked items using badges and a progress bar.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Guides new users through display name setup, optional questions, and required disclaimer and guidelines acceptance.",
  "frontend/src/components/reports/PersonalReportEditor.tsx": "Form dialog for creating, editing, and submitting personal reports with metadata and XP calculation.",
  "frontend/src/components/reports/ReportDialog.tsx": "Dialog for reporting users or entries with selectable reasons and optional details.",
  "frontend/src/components/share/ShareProductionLinkCard.tsx": "Displays the production URL, copy button, and downloadable QR code for sharing the app.",
  "frontend/src/components/sleepPerformance/LeaderSleepDoctrineModule.tsx": "Expandable module presenting leader sleep doctrine sections from static content.",
  "frontend/src/components/SoldierConnect/FlagReportDialog.tsx": "Dialog component that allows users to locally flag content with a reason and optional notes.",
  "frontend/src/components/SoldierConnect/ReactionBar.tsx": "Reaction bar rendering four reaction types with counts and callbacks, supporting compact and full layouts.",
  "frontend/src/components/system/AppStartupErrorState.tsx": "Full-screen error state with message, optional retry button, and troubleshooting note.",
  "frontend/src/components/system/InitWarningBanner.tsx": "Banner that displays a yellow warning message if provided.",
  "frontend/src/components/system/RouteErrorBoundary.tsx": "Error boundary that shows an app startup error state and allows retry on route errors.",
  "frontend/src/components/tools/MilitaryAppDetailsDialog.tsx": "React dialog component showing full details for a military app including tags, usage info, and download links.",
  "frontend/src/config/productionUrl.ts": "Exports a function that returns the production URL using an env variable or window location as fallback.",
  "frontend/src/content/assessmentOutcomes.ts": "Defines descriptive content and interactive insights for assessment outcomes, primarily OCEAN traits.",
  "frontend/src/content/assessments.ts": "Defines assessment metadata and question sets for multiple personality and resilience assessments.",
  "frontend/src/content/assessments/README.md": "Documentation explaining assessment module flow, data structures, scoring logic, and how to extend assessments.",
  "frontend/src/content/atp6225LeaderSleepDoctrine.ts": "Static structured content summarizing leader sleep doctrine from ATP 6-22.5 with multiple sections.",
  "frontend/src/content/dailyFactorGuidance.ts": "Provides anchor-based guidance for rating daily factors like sleep, training, stress, and pain on a 0–100 scale.",
  "frontend/src/content/dailyQuotes.ts": "Defines a DailyQuote interface and a list of motivational quotes with metadata and annotations, using generateQuoteId to assign IDs.",
  "frontend/src/content/disclaimer.ts": "Exports a disclaimer text clarifying the app is unofficial and reminding users of OPSEC responsibilities.",
  "frontend/src/content/izofEducation.ts": "Provides structured educational content explaining IZOF, eustress vs distress, individuality, and real‑world examples.",
  "frontend/src/content/izofRegulationSkills.ts": "Lists techniques for increasing and decreasing arousal to help users regulate stress levels.",
  "frontend/src/content/leaderGuidance.ts": "Defines leader guidance structures and provides role, communication, friction, and coaching recommendations for various assessment patterns.",
  "frontend/src/content/mentalPerformance/freeSoldierApps.ts": "Provides Libby usage guidance and a catalog of free mental‑performance and support apps for soldiers.",
  "frontend/src/content/mentalPerformance/lifeLessonsDisplayName.ts": "Empty file with no content.",
  "frontend/src/content/mentalPerformance/motivationalLifeLessonsVideos.ts": "Empty file with no content.",
  "frontend/src/content/mentalPerformance/recommendedReading.ts": "Defines recommended reading content, including Libby access instructions and a detailed book list with themes and actions.",
  "frontend/src/content/modules.ts": "Defines mission content including scenarios, decisions, timed steps, rewards, and reflection prompts.",
  "frontend/src/content/sleepPerformanceCopy.ts": "Provides static copy for sleep performance UI, including insights, mode descriptions, education tiles, and routines.",
  "frontend/src/content/tools/militaryApps.ts": "Lists military-related apps with descriptions, usage notes, download links, and tags.",
  "frontend/src/contexts/DashboardRefreshContext.tsx": "Implements a React context to trigger dashboard refreshes via a refresh token counter.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state and refreshes dependent queries.",
  "frontend/src/hooks/useAssessments.ts": "Manages local assessment storage, retrieval, trends, and unlock helpers using localStorage.",
  "frontend/src/hooks/useDashboard.ts": "Handles local daily readiness input submission, scoring, streaks, and state retrieval.",
  "frontend/src/hooks/useFieldMode.ts": "Stores and toggles a field-mode flag in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, stored identities, and auth-client setup.",
  "frontend/src/hooks/useIsMobile.ts": "Detects whether the viewport width is below a breakpoint for responsive UI behavior.",
  "frontend/src/hooks/useIzof.ts": "Manages IZOF daily check entries with local storage integration, creation, updates, and derived IZOF guidance.",
  "frontend/src/hooks/useIzofSettings.ts": "Loads and updates per-profile IZOF settings such as coach view and range overrides.",
  "frontend/src/hooks/useLifeLessonsProgress.ts": "Empty placeholder hook file with no implemented logic.",
  "frontend/src/hooks/useLocalData.ts": "Wraps localDataStore with React hooks for journals, daily inputs, and readiness state scoped to the current profile.",
  "frontend/src/hooks/useLocalProfile.ts": "Provides access to the device-scoped local profile with update, reset, and onboarding-state helpers.",
  "frontend/src/hooks/useLocalReports.ts": "Manages local personal reports including creation, updates, deletion, submission, and XP grant integration.",
  "frontend/src/hooks/useMissionProgression.ts": "Tracks and updates mission progression, XP, ranks, unlockables, and mission history in local storage.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks online/offline browser status via window event listeners.",
  "frontend/src/hooks/useProductionUrl.ts": "Resolves the production URL from config and optionally fetches a backend-provided live link.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend-dependent squad/group operations with graceful fallback when offline.",
  "frontend/src/hooks/useQuoteReflections.ts": "Loads and saves per-quote reflections tied to the local profile, exposing reflection state and a save function.",
  "frontend/src/hooks/useReadingProgress.ts": "Tracks per-book reading status in localStorage and provides helpers to update status and query completed or in‑progress books.",
  "frontend/src/hooks/useReadingRewards.ts": "Grants XP and badges for reading milestones with local deduplication and mission progression integration.",
  "frontend/src/hooks/useSafeActor.ts": "Creates an authenticated or anonymous backend actor and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useSleepPerformance.ts": "Manages sleep and caffeine logs with derived performance metrics and unlockable nap durations stored per profile.",
  "frontend/src/hooks/useSoldierConnect.ts": "Handles all Soldier Connect state and content operations with local persistence and XP rewards.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, mobile-safe rules, and utility classes for readiness and field mode.",
  "frontend/src/main.tsx": "Initializes the app root, wrapping it in InternetIdentity and React Query providers.",
  "frontend/src/pages/AdminReports.tsx": "Admin interface to list abuse reports, show statuses, and update them with backend connectivity checks.",
  "frontend/src/pages/AssessmentHistory.tsx": "Displays per‑assessment history and trend analysis using locally stored results with tabs for each assessment.",
  "frontend/src/pages/AssessmentLeaderView.tsx": "Shows leader-focused guidance derived from the user’s latest assessment outcomes, with role and coaching insights.",
  "frontend/src/pages/AssessmentResults.tsx": "Presents the computed assessment outcome, scores, briefing content, and navigation to historical trends.",
  "frontend/src/pages/AssessmentRun.tsx": "Runs an assessment questionnaire, scores answers, saves results locally, applies rewards, and navigates to results.",
  "frontend/src/pages/Assessments.tsx": "Entry page listing all assessments with completion status and links to history, leader view, and individual runs.",
  "frontend/src/pages/DailyDashboard.tsx": "Dashboard displaying readiness data, daily input logging, gamification, coach actions, and a scheduling form with online/offline handling.",
  "frontend/src/pages/DailyQuotes.tsx": "Shows a rotating daily quote and allows users to write and save personal reflections locally.",
  "frontend/src/pages/FreeSoldierApps.tsx": "Lists free wellness and resilience apps for soldiers with filtering, expandable details, and a Libby access guide.",
  "frontend/src/pages/Groups.tsx": "Manages user squads, letting users view, create, and join groups via dialogs and backend mutations.",
  "frontend/src/pages/GroupSharedEntries.tsx": "Displays a squad’s shared entries with member info, reporting, invite code management, and leave-group actions.",
  "frontend/src/pages/Guidelines.tsx": "Fetches and displays community guidelines with a simple loading state and static content.",
  "frontend/src/pages/IZOF.tsx": "Main IZOF landing page providing navigation to zone checks, education, regulation skills, dashboard, and coach-view toggle.",
  "frontend/src/pages/IZOFDailyZoneCheck.tsx": "Handles the daily stress check flow, showing forms, saved entries, and optional after-task reflections.",
  "frontend/src/pages/IZOFEducation.tsx": "Displays static IZOF educational content with multiple sections pulled from predefined content.",
  "frontend/src/pages/IZOFRegulationSkills.tsx": "Shows arousal-regulation techniques and includes a helper tool for choosing appropriate skills.",
  "frontend/src/pages/IZOFStressReadinessDashboard.tsx": "Dashboard visualizing stress trends, IZOF range estimates, pattern detection, and correlations using user entries.",
  "frontend/src/pages/Journal.tsx": "Local-only journal allowing creation, editing, and listing of entries with optional prefilled data.",
  "frontend/src/pages/LifeLessonsRemoved.tsx": "Placeholder page explaining removal of the Life Lessons section and linking to alternative resources.",
  "frontend/src/pages/MentalPerformanceReading.tsx": "Reading page with Libby guide, expandable book cards, and local progress and rewards tracking.",
  "frontend/src/pages/MilitaryApps.tsx": "Searchable, filterable directory of military apps with detail dialog support.",
  "frontend/src/pages/MissionRun.tsx": "Runs a mission by ID, handles completion flow, and shows mission debrief and reflection options.",
  "frontend/src/pages/Modules.tsx": "Mission browser with category tabs, mission cards, and operator progression panel.",
  "frontend/src/pages/MotivationalLifeLessons.tsx": "Empty file placeholder for a motivational life lessons page.",
  "frontend/src/pages/PublicLanding.tsx": "Empty file placeholder for the public landing page.",
  "frontend/src/pages/Reports.tsx": "Personal reports page with creation, editing, deletion, and XP display for reflections.",
  "frontend/src/pages/SettingsAbout.tsx": "Settings page for managing local profile, display name, device ID, and data reset.",
  "frontend/src/pages/SleepPerformanceAction.tsx": "UI for logging caffeine, viewing mode-based guidance, and getting sleep and nap recommendations.",
  "frontend/src/pages/SleepPerformanceAnalysis.tsx": "Displays sleep debt metrics and maps them to performance impacts with visual indicators.",
  "frontend/src/pages/SleepPerformanceCheckIn.tsx": "Form for logging a sleep session with optional pain and stress inputs.",
  "frontend/src/pages/SleepPerformanceDashboard.tsx": "Dashboard summarizing sleep metrics, readiness, debt, and mode settings with navigation to actions.",
  "frontend/src/pages/SoldierConnect/SoldierConnectHome.tsx": "Landing page listing Soldier Connect sections with counts and navigation.",
  "frontend/src/pages/SoldierConnect/SoldierConnectLayout.tsx": "Layout wrapper providing navigation tabs and routing for Soldier Connect pages.",
  "frontend/src/pages/Squads.tsx": "Empty file placeholder for squads page.",
  "frontend/src/pages/SquadSharedEntries.tsx": "Empty file placeholder for squad shared entries page.",
  "frontend/src/types/assessments.ts": "Type definitions for assessment configurations, questions, scoring, outcomes, and stored results.",
  "frontend/src/types/izof.ts": "Defines IZOF-related types for stress tracking, emotion categories, task types, and daily zone check entries.",
  "frontend/src/types/legacy.ts": "Contains legacy types for journaling, groups, reports, and older IZOF and personal report models used for compatibility.",
  "frontend/src/types/mentalPerformance.ts": "Provides type definitions for mental performance content modules, including app cards, tags, and Libby guide structures.",
  "frontend/src/types/militaryApps.ts": "Defines types for military app listings with tags, download links, and basic metadata.",
  "frontend/src/types/missions.ts": "Describes mission structures, steps, rewards, unlock rules, and progression logic including rank calculation.",
  "frontend/src/types/motivationalVideos.ts": "Empty placeholder file for motivational video types.",
  "frontend/src/types/personalReports.ts": "Defines types for personal video/book reports and input structures for creating or updating them.",
  "frontend/src/types/soldierConnect.ts": "Specifies all Soldier Connect community types including threads, stories, mentor notes, challenges, reactions, and notifications.",
  "frontend/src/utils/assessmentScoring.ts": "Implements scoring logic for dimensional, type-based, and band assessments producing structured outcomes.",
  "frontend/src/utils/backendError.ts": "Maps backend errors to simplified user-friendly messages with suggested actions.",
  "frontend/src/utils/clipboard.ts": "Provides a safe clipboard copy utility with fallback for unsupported browsers.",
  "frontend/src/utils/dailyRotation.ts": "Generates a deterministic daily index based on hashed local date.",
  "frontend/src/utils/inviteCode.ts": "Normalizes invite codes by trimming whitespace.",
  "frontend/src/utils/izofAnalytics.ts": "Offers local analytics for IZOF entries including trends, correlations, pattern detection, and weekly aggregations.",
  "frontend/src/utils/izofIntegration.ts": "Combines IZOF stress, training load, and sleep data to generate cross‑factor insights and detect missing inputs.",
  "frontend/src/utils/izofLogic.ts": "Provides IZOF range estimation, stress‑zone recommendations, state categorization, and validation for daily zone checks.",
  "frontend/src/utils/localDataStore.ts": "Handles localStorage persistence for journals, readiness inputs, sleep logs, caffeine logs, IZOF data, and related local-only types.",
  "frontend/src/utils/localProfileStorage.ts": "Manages creation, retrieval, update, and reset of device-scoped user profiles in localStorage.",
  "frontend/src/utils/militaryAppsFilter.ts": "Filters military apps by selected tag and search query across name, description, usage, and tags.",
  "frontend/src/utils/qrcode.ts": "Generates QR codes on a canvas via an external API with a fallback renderer and supports PNG download.",
  "frontend/src/utils/quoteId.ts": "Creates deterministic quote IDs using a simple hash of quote text and author.",
  "frontend/src/utils/readinessSemantics.ts": "Maps factor scores to readiness-friendly values and color classes based on polarity and provides band-based explanation selection.",
  "frontend/src/utils/reportXp.ts": "Computes XP for reports using deterministic thresholds based on character length.",
  "frontend/src/utils/sleepPerformance.ts": "Computes sleep debt and related performance metrics, formats sleep windows, and provides caffeine clearance and pain/stress guidance utilities.",
  "frontend/src/utils/soldierConnectDeepLinks.ts": "Builds and parses deep links for Soldier Connect threads and stories using URL query parameters.",
  "frontend/src/utils/soldierConnectNotifications.ts": "Generates local notifications for Soldier Connect events like replies, highlights, mentor notes, and challenge reminders.",
  "frontend/src/utils/soldierConnectStore.ts": "Manages Soldier Connect local storage state and provides CRUD operations for threads, stories, replies, and related metadata.",
  "frontend/src/utils/soldierConnectXp.ts": "Defines XP values and functions to compute XP for various Soldier Connect actions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings and sessionStorage.",
  "frontend/src/utils/validateMotivationalVideos.ts": "File is empty and contains no implementation.",
  "frontend/src/utils/youtubeId.ts": "Extracts YouTube video IDs, validates URLs, and generates fallback YouTube search URLs.",
  "frontend/src/vite-env.d.ts": "Declares Vite environment variable types for the frontend.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, plugins, colors, animations, and content paths.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related build files, enabling strict mode and composite builds.",
  "frontend/vite.config.ts": "Vite config defining React plugin, path aliases, build output settings, chunking, and dev server options.",
  "project_state.json": "Maintains project state metadata including existing features for showing a live deployment URL and QR code, plus one pending feature request. Tracks versions, issues, and basic project info."
}