{
  "backend/main.mo": "Motoko canister implementing core backend logic: user profiles with invite-only onboarding and disclaimer acceptance, private/shared journal entries, invite-only squad groups (max 45 members), abuse reports, and role-based access control with admin moderation.",
  "feature_evidence.json": "Structured feature evidence report mapping product requirements to implemented frontend files, components, and test IDs, documenting confidence for onboarding, disclaimers, invite-only limits, journaling, squads, and reporting features.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing app structure, pages, components, hooks, styling, and feature coverage for documentation and planning purposes.",
  "frontend/index.css": "Global Tailwind CSS base defining OKLCH color tokens, light/dark theme variables, and shared layout styles for a calm earth‑tone design system.",
  "frontend/index.html": "HTML entry point bootstrapping the React application with a root div, module script, viewport metadata, and descriptive page title.",
  "frontend/src/App.tsx": "Root React application configuring authentication flow, onboarding gating, theming, and TanStack Router routes for public, user, and admin pages.",
  "frontend/src/components/journal/JournalEditor.tsx": "Stateful journal entry editor component supporting create, update, delete, and optional squad sharing with validation, confirmation dialogs, and backend mutations.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application shell with header navigation, mobile menu, and user dropdown, handling routing, active nav state, and logout via Internet Identity and React Query cache clearing.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Implements a two-step onboarding flow where users accept an invite (username + code) and then agree to a disclaimer and guidelines, using mutations and showing validation/error states.",
  "frontend/src/components/reports/ReportDialog.tsx": "Provides a modal dialog for reporting an entry or user, collecting a reason and optional details, and submitting the report via a mutation with toast feedback.",
  "frontend/src/content/disclaimer.ts": "Exports a static disclaimer text explaining the app’s unofficial status, educational purpose, OPSEC responsibilities, and usage terms.",
  "frontend/src/content/modules.ts": "Defines TypeScript interfaces and a static list of learning modules containing quotes, interpretations, and journaling prompts for mental readiness and resilience topics.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity, initializes access control, and invalidates/refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication, managing login/logout, persisted identity loading, and detailed login status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines a large set of React Query hooks for fetching and mutating backend data via an actor, including user profiles, invites, journaling, squads, reports, guidelines, and admin actions, with cache invalidation on mutations.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles and defines a comprehensive light and dark theme using CSS variables with warm, earth-toned color palettes.",
  "frontend/src/main.tsx": "Bootstraps the React application by rendering the root component wrapped with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminReports.tsx": "Implements an admin-only page for viewing, sorting, and updating the status of community reports, with permission checks and status-specific UI badges.",
  "frontend/src/pages/Guidelines.tsx": "Displays static community guidelines content fetched via a query hook, with loading states and styled presentation.",
  "frontend/src/pages/Journal.tsx": "Provides the journal interface for listing, creating, editing, and deleting personal or shared journal entries, including navigation-based prefilled editor support.",
  "frontend/src/pages/Modules.tsx": "Renders categorized learning modules with quotes and exercises, allowing users to start a guided journal reflection prefilled from module content.",
  "frontend/src/pages/PublicLanding.tsx": "Public landing page describing the platform’s purpose and features, displaying a disclaimer, and providing Internet Identity sign-in with error handling.",
  "frontend/src/pages/SettingsAbout.tsx": "Settings and About page showing the user’s profile details, disclaimer acceptance status, and static information about the app’s purpose, content sources, and privacy.",
  "frontend/src/pages/Squads.tsx": "Squads overview page listing the user’s squads and providing dialogs to create a new squad or join one via invite code with validation and error feedback.",
  "frontend/src/pages/SquadSharedEntries.tsx": "Squad detail page that loads squad info, members, and shared entries, and lets users manage invites, leave squads, rotate invite codes, and report entries.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters from query strings or hash routes and persisting, retrieving, or clearing them via sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors via CSS variables, fonts, animations, container settings, and enabled plugins.",
  "project_state.json": "Defines the overall project vision, schema/versioning, and a roadmap of existing features for an invite-only mental readiness app, including disclaimers, identity/onboarding, capped user access, private journaling with optional squad sharing, squad group mechanics, and doctrine-informed content modules."
}