{
  "backend/main.mo": "Motoko canister defining access control, user profiles, journal entries, squads, reports, daily readiness inputs, and gamification logic with stateful maps and helper functions.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test identifiers for Sleep Performance and other app features.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing routing, UI components, content modules, and offline‑first behavior.",
  "frontend/index.css": "Global Tailwind CSS base defining OKLCH design tokens, dark mode variables, and shared utility styles for app theming.",
  "frontend/index.html": "HTML entry point containing root mount node, favicon, metadata, and module script loader.",
  "frontend/src/App.tsx": "Main React router configuration defining routes for core features and the full Sleep Performance flow within the AppShell layout.",
  "frontend/src/components/assessments/AssessmentQuestionnaire.tsx": "Interactive assessment questionnaire component with progress tracking, navigation controls, and answer validation.",
  "frontend/src/components/assessments/OutcomeBriefingCards.tsx": "Displays assessment outcomes using cards and alerts, including text insights and interactive scenario choices with state-tracked selections.",
  "frontend/src/components/dashboard/CoachActionsCard.tsx": "Generates and displays prioritized daily coaching actions based on logged scores and streak, with dynamic icons and badges.",
  "frontend/src/components/dashboard/DailyLoggingPanel.tsx": "Provides sliders for logging daily readiness factors and submits them via a controlled form with loading and offline states.",
  "frontend/src/components/dashboard/GamificationCard.tsx": "Shows streaks, readiness tier, and earned achievement badges based on overall score and consistency.",
  "frontend/src/components/dashboard/ReadinessMeter.tsx": "Presents overall readiness score, factor breakdowns, and optional analysis with tier-based coloring and streak display.",
  "frontend/src/components/fieldMode/FieldModeToggle.tsx": "Toggles Field Mode using a switch bound to a custom hook with visual state indication.",
  "frontend/src/components/journal/JournalEditor.tsx": "Local journal entry editor supporting create, update, and delete with validation, persistence hooks, and toast feedback.",
  "frontend/src/components/layout/AppShell.tsx": "Main application shell providing navigation, mobile menu, profile actions, field mode toggle, and reset-data dialog.",
  "frontend/src/components/missions/MissionCard.tsx": "Renders a mission card with briefing, rewards, win conditions, completion state, and detailed unlock-rule checks including assessment requirements.",
  "frontend/src/components/missions/MissionDebrief.tsx": "Displays mission results including pass/fail, score, XP, side quests, win‑condition breakdown, and optional reflection actions.",
  "frontend/src/components/missions/MissionRunner.tsx": "Runs mission steps, handles choices, scoring, timed steps, side quests, and produces the final MissionResult.",
  "frontend/src/components/missions/OperatorProgressPanel.tsx": "Shows operator XP, rank progression, and recently unlocked items with tactical‑style formatting.",
  "frontend/src/components/onboarding/OnboardingFlow.tsx": "Guides new users through display name, disclaimers, and optional questions before saving profile info locally.",
  "frontend/src/components/reports/ReportDialog.tsx": "Modal dialog for submitting abuse reports with reason selection, optional details, and async mutation handling.",
  "frontend/src/components/system/AppStartupErrorState.tsx": "Full-screen error state component showing a startup failure message with an optional retry button.",
  "frontend/src/components/system/InitWarningBanner.tsx": "Banner displaying a non-null initialization warning using a styled alert component.",
  "frontend/src/content/assessmentOutcomes.ts": "Defines detailed outcome content for assessment results, including explanations, relevance, and interactive insight cards.",
  "frontend/src/content/assessments.ts": "Provides assessment definitions with questions, scoring keys, and metadata for multiple personality and resilience models.",
  "frontend/src/content/assessments/README.md": "Developer documentation explaining assessment flow, structure, scoring logic, and how to extend assessments.",
  "frontend/src/content/disclaimer.ts": "Exports the application's disclaimer text clarifying its unofficial status and OPSEC responsibilities.",
  "frontend/src/content/leaderGuidance.ts": "Contains leader guidance content mapping assessment outcomes to team roles, communication styles, friction points, and coaching strategies.",
  "frontend/src/content/modules.ts": "Defines mission content including scenarios, decisions, timed steps, side quests, and reflection prompts in a structured Mission array.",
  "frontend/src/content/sleepPerformanceCopy.ts": "Provides all text strings for the sleep performance dashboard, including microcopy, mode descriptions, and educational tiles.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useAssessments.ts": "Handles local assessment storage, retrieval, trends, and unlock checks using localStorage keyed by device UUID.",
  "frontend/src/hooks/useDashboard.ts": "Computes and provides readiness data and handles saving daily inputs, scoring logic, and streak updates locally.",
  "frontend/src/hooks/useFieldMode.ts": "Stores and toggles a boolean field‑mode flag in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and actions via Internet Identity, loading stored identities and managing login/logout behavior.",
  "frontend/src/hooks/useLocalData.ts": "Provides React hooks for local journals, daily inputs, and readiness state scoped to the local profile.",
  "frontend/src/hooks/useLocalProfile.ts": "Manages the device-scoped local profile with update, reset, and onboarding state helpers.",
  "frontend/src/hooks/useMissionProgression.ts": "Tracks mission progression, XP, ranks, unlockables, and mission history stored per device.",
  "frontend/src/hooks/useOnlineStatus.ts": "Exposes a boolean reactive online/offline status using browser events.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for optional backend operations with local-first fallbacks.",
  "frontend/src/hooks/useSafeActor.ts": "Initializes and manages a safe backend actor tied to Internet Identity with automatic query invalidation.",
  "frontend/src/hooks/useSleepPerformance.ts": "Handles sleep and caffeine logs, computes sleep performance metrics, and updates related local state.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark themes and field-mode UI adjustments.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity, and rendering the app.",
  "frontend/src/pages/AdminReports.tsx": "Displays a list of abuse reports, shows backend availability state, and allows admins to update report statuses.",
  "frontend/src/pages/AssessmentHistory.tsx": "Shows past assessment results and trend data using local storage, organized by tabs for each assessment type.",
  "frontend/src/pages/AssessmentLeaderView.tsx": "Provides leader-focused guidance based on the latest assessment results stored locally, including team roles and recommendations.",
  "frontend/src/pages/AssessmentResults.tsx": "Renders a completed assessment’s outcome, scores, reward info, and briefing content with navigation to history and trends.",
  "frontend/src/pages/AssessmentRun.tsx": "Runs an assessment questionnaire, scores the responses, saves the result, applies rewards, and navigates to the results page.",
  "frontend/src/pages/Assessments.tsx": "Entry page for the assessments module showing available assessments, completion status, and quick navigation to history and leader views.",
  "frontend/src/pages/DailyDashboard.tsx": "Dashboard page showing readiness status, quick logging, and sync/offline indicators using various hooks and cards.",
  "frontend/src/pages/Groups.tsx": "Groups management page allowing users to view, create, and join squads with dialogs and backend interactions.",
  "frontend/src/pages/GroupSharedEntries.tsx": "Displays shared squad entries, group details, and member list with actions like copying invite codes, rotating codes, and leaving the group.",
  "frontend/src/pages/Guidelines.tsx": "Fetches and displays community guidelines in a simple card layout with loading handling.",
  "frontend/src/pages/Journal.tsx": "Local-only journal interface for creating, editing, and viewing private entries with optional prefilled content.",
  "frontend/src/pages/MissionRun.tsx": "Runs a mission by ID, handling progression, completion, debrief, retries, and optional journal reflection prompts.",
  "frontend/src/pages/Modules.tsx": "Renders mission categories, mission cards, and operator progress with tab-based filtering and navigation to mission details.",
  "frontend/src/pages/PublicLanding.tsx": "Empty page placeholder with no implemented content.",
  "frontend/src/pages/SettingsAbout.tsx": "Displays and edits local profile info, device ID, creation date, and disclaimer status using form controls and cards.",
  "frontend/src/pages/SleepPerformanceAction.tsx": "Provides mode-based sleep guidance, caffeine logging, nap recommendations, and related tactical tools.",
  "frontend/src/pages/SleepPerformanceAnalysis.tsx": "Shows sleep debt metrics and maps them to performance impacts such as reaction time and injury risk.",
  "frontend/src/pages/SleepPerformanceCheckIn.tsx": "Form for logging a sleep window with optional pain and stress inputs before saving and navigating to analysis.",
  "frontend/src/pages/SleepPerformanceDashboard.tsx": "Dashboard showing sleep metrics, readiness indicators, mode selection, and quick summaries with navigation to log sleep.",
  "frontend/src/pages/Squads.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/SquadSharedEntries.tsx": "Empty file with no implemented content.",
  "frontend/src/types/assessments.ts": "Defines TypeScript models for assessments, including questions, options, scoring, outcomes, and stored results.",
  "frontend/src/types/legacy.ts": "Contains legacy types for journaling, groups, and reports used for compatibility with unimplemented backend features.",
  "frontend/src/types/missions.ts": "Defines mission structures including steps, choices, win conditions, rewards, unlock rules, and progression logic.",
  "frontend/src/utils/assessmentScoring.ts": "Provides scoring functions for dimensional, type-based, and banded assessments, generating deterministic outcomes.",
  "frontend/src/utils/backendError.ts": "Maps backend error messages to user-friendly guidance with offline-first handling and generic fallbacks.",
  "frontend/src/utils/inviteCode.ts": "Trims whitespace from invite codes before backend validation.",
  "frontend/src/utils/localDataStore.ts": "Implements localStorage-backed persistence for journals, readiness inputs, missions, assessments, sleep logs, and caffeine logs.",
  "frontend/src/utils/localProfileStorage.ts": "Manages device-scoped profile data with UUID generation, loading, saving, and resetting logic.",
  "frontend/src/utils/sleepPerformance.ts": "Calculates sleep debt, readiness, risk metrics, caffeine effects, and provides sleep-related guidance utilities.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read URL params (including hash-based), persist them in sessionStorage, and clear them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing the app’s offline-first React SPA design, current scope, and a list of implemented features with metadata."
}