{
  "kind": "build_request",
  "title": "Fix app failing to load after Internet Identity sign-in",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix authenticated app initialization so the frontend can create a logged-in actor even when the admin bootstrap secret is not present. Specifically: do not let `useActor` block or crash the app if `_initializeAccessControlWithSecret` traps (e.g., missing/empty `caffeineAdminToken` or missing backend env token); instead, continue with a usable authenticated actor and surface a clear error message in the UI only if the failure prevents core user flows.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The app does not open.\n\nThe sign in does not let me in"
        ]
      },
      "acceptanceCriteria": [
        "After successful Internet Identity login, the app no longer gets stuck on a loading screen due to actor initialization errors.",
        "If access-control bootstrap fails, the user sees an English error message that explains something like: \"App initialization failed. Please refresh and try again.\" (and the app remains usable for normal sign-in/onboarding when possible)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix open registration and onboarding by updating backend authorization logic so a newly authenticated (but not yet registered) user can reach onboarding and successfully register. At minimum: (1) `registerUser` must not call an admin-only role-assignment path that traps for normal users; it must grant the caller the `#user` role in a way that works for self-registration, and (2) `getCallerUserProfile` must not trap for users who are authenticated but not yet registered; it should return `null` in that case so the frontend can show the onboarding flow.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The sign in does not let me in"
        ]
      },
      "acceptanceCriteria": [
        "A new Internet Identity user can sign in, see the onboarding flow, register a username, accept the disclaimer/guidelines, and then access the main app shell.",
        "Calling `getCallerUserProfile` before registration returns `null` (or equivalent optional none) rather than trapping with an authorization error.",
        "Calling `registerUser` as a non-admin does not trap and results in the caller being treated as a `#user` for subsequent gated endpoints."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a user-visible error state for the post-login profile load/authorization step so that if `getCallerUserProfile` (or other initial authenticated calls) fails, the UI shows an English message and a retry action instead of appearing to not open.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The app does not open."
        ]
      },
      "acceptanceCriteria": [
        "If the current-user profile query errors, the user sees a clear error message and a button like \"Retry\" (or equivalent) to re-attempt loading without a full hard refresh.",
        "The app does not remain indefinitely in a spinner-only state when the initial authenticated queries fail."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (do not introduce additional backend services).",
    "Do not edit files under frontend/src/components/ui (compose them instead).",
    "Do not modify frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui). If changes are required, implement wrappers or alternatives in new files and update call sites."
  ],
  "nonGoals": [
    "Do not add new authentication providers (Internet Identity remains the only auth method).",
    "Do not redesign unrelated product features (journaling, groups, modules, reports) beyond what is necessary to fix app loading/sign-in/registration."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}