{
  "kind": "build_request",
  "title": "Provide live deployment link and shareable QR code",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "After publishing the current build live on the Internet Computer, provide the live production URL as a user-facing link that can be copied.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Yes and can you give me a link and qr code"
        ]
      },
      "acceptanceCriteria": [
        "The app is deployed successfully and loads from a stable production URL.",
        "The production URL is captured in a single configurable place in the frontend (e.g., env/config) rather than hard-coded across multiple components.",
        "Users can view the production URL in the UI and copy it to the clipboard with clear success feedback in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an in-app share surface (e.g., in Settings/About) that displays a QR code encoding the live production URL and allows downloading the QR as an image.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Yes and can you give me a link and qr code"
        ]
      },
      "acceptanceCriteria": [
        "A QR code is rendered in the UI that, when scanned, resolves to the production URL from REQ-1.",
        "The share surface includes a visible text link of the same URL and a one-click copy action.",
        "Users can download/save the QR code as an image file (e.g., PNG) from the browser.",
        "All user-facing labels, buttons, and messages are in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not modify files under frontend/src/components/ui (shadcn) directly; compose components instead.",
    "Do not edit immutable hook/bootstrap files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Adding third-party authentication providers beyond Internet Identity.",
    "Adding real-time communication features (WebSockets/chat).",
    "Generating or storing QR codes via the backend canister."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}