{
  "kind": "build_request",
  "title": "Replace 'Coming Soon' motivational videos with real YouTube links so all videos play",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Motivational Life Lessons video dataset so that every video currently labeled \"Coming Soon\" has a real, playable YouTube URL and matching thumbnail URL. Specifically, in `frontend/src/content/mentalPerformance/motivationalLifeLessonsVideos.ts`, find every `MotivationalVideo` entry where `youtubeUrl` contains the substring `placeholder` (these are rendered as \"Coming Soon\" in `frontend/src/components/mentalPerformance/MotivationalVideoCard.tsx`) and, for each one, search YouTube for the correct video and replace:\n- `youtubeUrl` with the real YouTube watch URL (or youtu.be URL)\n- `thumbnailUrl` with the correct `https://img.youtube.com/vi/<VIDEO_ID>/maxresdefault.jpg` using the actual video ID extracted from the new URL\n\nDo not change the existing `id` values or category tags; only replace placeholder URLs with real ones so the UI no longer blocks playback and the dialog embed works for all videos.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "For each video labeled coming soon: search YouTube for the link and add it so all videos are playable"
        ]
      },
      "acceptanceCriteria": [
        "In `frontend/src/content/mentalPerformance/motivationalLifeLessonsVideos.ts`, there are no `youtubeUrl` values containing `placeholder`.",
        "In the Motivational Life Lessons page, no video cards show the \"Coming Soon\" overlay (which is currently triggered by `video.youtubeUrl.includes('placeholder')`).",
        "Clicking any video card in the Motivational Life Lessons page opens the player dialog and shows an embedded YouTube video (not the \"Video unavailable\" fallback).",
        "For each updated video, the thumbnail loads successfully and matches the YouTube video ID used in the `youtubeUrl` (i.e., `thumbnailUrl` uses the same `<VIDEO_ID>`)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Keep the backend single-actor architecture unchanged; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not add new video categories, change existing video IDs, or rewrite lesson/takeaway copy beyond what is required to attach the correct playable YouTube links.",
    "Do not implement automated YouTube search/API integration; links can be updated directly in the static dataset file."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}