{
  "kind": "build_request",
  "title": "Fix global invite code validation so users can complete onboarding and preview the app",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update backend global invite code validation in `backend/main.mo` so that `acceptInvite(username, inviteCode)` accepts the intended global invite code \"Dagger\" in a robust, user-friendly way by normalizing the user-provided invite code before comparison (at minimum: trim leading/trailing whitespace and compare case-insensitively). Ensure the comparison is performed against a similarly-normalized canonical global invite code.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "The invite code you entered is invalid. Please check and try again  \nI can’t preview the app the invite code does not work"
        ]
      },
      "acceptanceCriteria": [
        "A new user can register successfully when entering \"Dagger\", \"dagger\", or \"DAGGER\".",
        "A new user can register successfully when entering the correct invite code with leading/trailing spaces (e.g., \"  Dagger  \").",
        "If an incorrect invite code is entered, the backend still rejects registration with an \"Invalid invite code\" trap/message (so the frontend continues to show the existing invalid-invite error state)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the onboarding invite step UI (`frontend/src/components/onboarding/OnboardingFlow.tsx`) to ensure the invite code sent to `acceptInvite` is normalized consistently and to reduce user error: trim the invite code before submission, and add concise helper text indicating the global invite code is not case-sensitive.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "The invite code you entered is invalid. Please check and try again  \nI can’t preview the app the invite code does not work"
        ]
      },
      "acceptanceCriteria": [
        "Submitting the invite step always sends a trimmed invite code value (no leading/trailing whitespace) to the backend.",
        "The invite step displays English helper text that clearly states the invite code is not case-sensitive.",
        "The existing error message shown for invalid invite codes remains in English: \"The invite code you entered is invalid. Please check and try again.\""
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko architecture (all logic in `backend/main.mo`).",
    "Do not modify any frontend files under `frontend/src/components/ui` or other immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not change the maximum user capacity (45) or other registration policy beyond invite code normalization/validation.",
    "Do not introduce new authentication providers (Internet Identity remains the only auth mechanism).",
    "Do not add new onboarding steps or redesign unrelated pages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}