{
  "kind": "build_request",
  "title": "Remove Motivational Videos (Life Lessons) section",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Remove the Motivational Videos / Life Lessons section from the app UI so it is no longer discoverable from primary navigation (sidebar) and no longer presents a videos library experience.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Delete the motivational videos section entirely"
        ]
      },
      "acceptanceCriteria": [
        "The sidebar navigation in AppShell no longer shows a nav item for the Motivational Videos / Life Lessons section.",
        "No page in the app renders the motivational videos grid, search, filters, favorites-only toggle, or YouTube player dialog UI.",
        "The app builds without TypeScript errors after removing the section and any now-unused imports."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Keep the existing route path '/mental-performance/life-lessons' stable, but ensure it no longer exposes the motivational videos section (e.g., redirect to a remaining Mental Performance page, or show a simple removed-section message with navigation back).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Delete the motivational videos section entirely"
        ]
      },
      "acceptanceCriteria": [
        "Navigating directly to '/mental-performance/life-lessons' does not show the motivational videos experience.",
        "The route path string '/mental-performance/life-lessons' remains unchanged in the app routing configuration.",
        "User-facing text shown on this route (if any) is in English and clearly indicates the section is no longer available, with an obvious way to navigate elsewhere."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Delete or fully decommission motivational-video-specific frontend modules so there is no remaining dead code or unused assets for this section (page, components, hooks, and content) unless they are still referenced by other active features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Delete the motivational videos section entirely"
        ]
      },
      "acceptanceCriteria": [
        "The project has no unused imports referencing motivational-video-specific files (e.g., MotivationalLifeLessons page, MotivationalVideoCard, YouTubePlayerDialog, motivationalLifeLessonsVideos content, life lessons progress hook) after the change.",
        "Any localStorage keys / progress logic used only by the removed section is no longer written to by the app.",
        "The app runtime has no console errors related to removed motivational-video modules during normal navigation."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only components must be composed, not modified).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Backend remains single-actor; no backend changes are required for removing a purely frontend section."
  ],
  "nonGoals": [
    "Do not redesign or change other Mental Performance sections (Recommended Reading, Free Soldier Apps, Military Apps, IZOF).",
    "Do not add new content sections to replace the removed motivational videos section.",
    "Do not introduce new authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}