{
  "kind": "build_request",
  "title": "Fix sidebar/drawer event handling and ensure dropdown menus remain clickable",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Audit and fix event handling in the main layout so clicks always reach intended targets after introducing flex/grid wrappers or overlays. Specifically ensure no transparent overlay, fixed element, or container with unintended `pointer-events: none` blocks interaction with main content (e.g., Life Lessons video cards, filters, and dialogs) when the mobile drawer is closed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Ensure proper event handling\n\t•\tSometimes adding flex/grid containers with new wrappers can stop events from propagating.\n\t•\tMake sure your clickable elements aren’t inside a transparent overlay or a pointer-events: none container."
        ]
      },
      "acceptanceCriteria": [
        "When the mobile drawer is closed, all interactive elements in main content pages (including /mental-performance/life-lessons) are clickable and receive pointer events normally.",
        "There is no persistent full-screen overlay/backdrop element remaining mounted or intercepting clicks after the drawer closes.",
        "No parent wrappers added for layout purposes prevent click handlers from firing on nested interactive elements (buttons, links, cards, filter controls)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the sidebar + main content layout structure to follow a predictable container model for overlays/menus: keep the sidebar and main content as sibling regions and ensure any dropdown menu surfaces (e.g., account dropdown in the sidebar) render above other layers with an appropriate z-index and without being clipped by overflow rules.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "4. Recommended structure for sidebar + main content + dropdowns\n<div class=\"app-container\">\n  <div class=\"sidebar\">\n    <button class=\"hamburger\">☰</button>\n    <ul class=\"dropdown-menu\">\n      <li>Life Lessons</li>\n      <li>Mental Performance</li>\n      <li>Sleep Performance</li>\n    </ul>\n  </div>\n\n  <div class=\"main-content\">\n    <!-- videos or other content -->\n  </div>\n</div>\n\n.dropdown-menu {\n  position: absolute; /* floats on top */\n  z-index: 1000;\n  display: none;      /* toggle with JS */\n}\n\n.dropdown-menu.active {\n  display: block;\n}"
        ]
      },
      "acceptanceCriteria": [
        "Sidebar dropdown menus (including the existing account dropdown) appear above the sidebar/drawer and main content (effective z-index), and remain clickable on both mobile and desktop.",
        "Dropdown/overlay surfaces are not clipped by parent containers (e.g., due to `overflow-hidden`) in normal sidebar-open scenarios.",
        "The layout remains: sidebar/drawer and main content are sibling regions; overlays/backdrops are layered predictably (backdrop below drawer, drawer below dropdown content where applicable)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the hamburger-triggered mobile navigation and backdrop in `frontend/src/components/layout/AppShell.tsx` do not interfere with click propagation: the backdrop must only be present while the drawer is open; clicking the backdrop closes the drawer; and clicks inside the drawer must not bubble to the backdrop close handler.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make sure your clickable elements aren’t inside a transparent overlay or a pointer-events: none container."
        ]
      },
      "acceptanceCriteria": [
        "When the mobile drawer is open, tapping/clicking the backdrop closes it reliably.",
        "When the mobile drawer is open, interacting with items inside the drawer (nav buttons, account dropdown trigger, Settings/Guidelines links, Field Mode toggle) does not accidentally trigger backdrop dismissal unless the user actually taps the backdrop.",
        "When the mobile drawer is closed, it has no hitbox (no click interception) and does not block interaction with main content."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI component sources).",
    "Do not modify immutable hook entrypoints: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Preserve existing route paths, especially the Life Lessons route path `/mental-performance/life-lessons` (must remain unchanged).",
    "Keep the existing desktop sidebar behavior (persistent at `md` and above, including current expand/collapse toggle behavior)."
  ],
  "nonGoals": [
    "No backend/Motoko changes.",
    "No new authentication providers or third-party integrations.",
    "No redesign of page-level content (e.g., changing Life Lessons filtering logic or video dialog behavior) beyond fixing click/event-handling and layering issues."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}