{
  "kind": "build_request",
  "title": "Fix mobile sidebar drawer to auto-close instantly on menu selection (md breakpoint)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the mobile sidebar drawer behavior (below Tailwind `md` / <=767px) so the drawer closes immediately when any sidebar menu item is clicked, without waiting for route navigation to finish, and the main content becomes fully visible and interactive (no overlap).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Close the sidebar immediately on click of any menu item (e.g., when user taps \"Life Lessons\" or \"Journal\"). Don't wait for navigation to finish—close right away to give instant feedback on mobile."
        ]
      },
      "acceptanceCriteria": [
        "On screens <768px, opening the hamburger menu and tapping any nav item (e.g., Life Lessons, Journal, Dashboard, etc.) closes the drawer immediately.",
        "After the drawer closes, the selected page content (videos/filters/search where applicable) is fully visible and clickable with no sidebar overlay blocking interaction.",
        "Desktop behavior at >=768px remains unchanged (sidebar persistent; no auto-close requirement)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the mobile drawer cannot block taps or scrolling after it has been closed (e.g., prevent the off-canvas drawer element from capturing pointer events when closed, and/or only render the drawer/backdrop when open).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "the sidebar menu ... stays open and overlays the main content ... This blocks the videos, filters, and search bar—users can't see or interact with the page properly."
        ]
      },
      "acceptanceCriteria": [
        "When the mobile drawer is closed, all main content areas can be scrolled and interacted with normally (no invisible overlay capturing touches/clicks).",
        "The drawer/backdrop layering does not interfere with the header controls after closing (hamburger is usable again)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add/verify a semi-transparent backdrop for the mobile drawer (below `md`) that appears only when the drawer is open and closes the drawer when the user taps outside the sidebar area.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "On mobile, make sure there's a semi-transparent backdrop when sidebar is open (so tapping outside closes it too, as a bonus UX)."
        ]
      },
      "acceptanceCriteria": [
        "On screens <768px, opening the drawer shows a semi-transparent backdrop behind it.",
        "Tapping the backdrop closes the drawer immediately.",
        "On >=768px, no mobile backdrop is shown."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Keep existing UI/UX and features unchanged aside from the mobile drawer fix: preserve dark theme styling, icons, existing navigation labels/paths (including the Life Lessons path), and existing page functionality (video list, filters, search, etc.).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Keep all existing dark theme, icons, video list, filters, etc., unchanged."
        ]
      },
      "acceptanceCriteria": [
        "No visual/theme regressions are introduced outside of the mobile drawer open/close and backdrop behavior.",
        "All existing navigation items and route paths remain the same (especially `/mental-performance/life-lessons`)."
      ]
    }
  ],
  "constraints": [
    "Use Tailwind's default `md` breakpoint (768px) as the cutoff: below md is mobile drawer/overlay behavior; md and above is persistent desktop sidebar behavior.",
    "Do not edit files under frontend/src/components/ui (compose only).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add new sections, routes, or content features beyond the sidebar drawer behavior fix.",
    "Do not change desktop sidebar persistence/toggle behavior beyond what is required to keep it working.",
    "Do not redesign the app theme, icons, or layout."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}