{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Invite-only resilience journaling app (frontend plan)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Internet Identity sign-in with first-time onboarding for unique username + disclaimer/guidelines acknowledgement, and profile access thereafter.",
      "acceptanceCriteria": [
        "User can sign in with Internet Identity from the frontend.",
        "On first sign-in, user must set a unique username (case-insensitive uniqueness) before accessing app features.",
        "User must acknowledge the non-affiliation disclaimer and community guidelines during onboarding; acknowledgement is stored and can be re-shown from Settings/About."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "create",
          "description": "Create the root app component that coordinates authentication (Internet Identity), loads caller profile via backendInterface.getCallerUserProfile(), and conditionally renders: (1) public routes when unauthenticated, (2) onboarding flow when authenticated but profile is missing or acknowledgements incomplete, and (3) the authenticated app shell otherwise. Use the authorization selected component patterns for profile gating and role checks; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/router.tsx",
          "operation": "create",
          "description": "Add route definitions for public (Landing/Disclaimer, Guidelines) and authenticated areas (Journal, Squads, Modules, Settings/About, Admin Reports). Ensure onboarding is not an orphan by wiring it as an in-app blocking screen/modal route when required. Use the authorization selected component patterns for access gating; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AuthGate.tsx",
          "operation": "create",
          "description": "Create an auth gate wrapper that uses useInternetIdentity identity presence plus react-query cached actor/profile state to prevent showing protected content before authentication and profile readiness. Use the authorization selected component guidance to avoid profile setup flash; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/onboarding/OnboardingFlow.tsx",
          "operation": "create",
          "description": "Implement onboarding UI to (a) collect invite code + chosen username, (b) submit registration via backendInterface.acceptInvite(username, inviteCode), and (c) require acknowledging disclaimer + guidelines (calling backendInterface.acceptDisclaimer() and persisting acknowledgement state from profile). Ensure users cannot reach app features until completion. Use the authorization selected component profile setup guidance; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SettingsAbout.tsx",
          "operation": "create",
          "description": "Create Settings/About screen that can re-show the stored disclaimer and guidelines acknowledgement status using backendInterface.getCallerUserProfile() and backendInterface.getGuidelines(), and provide a way to re-open the disclaimer/guidelines content (read-only)."
        },
        {
          "path": "frontend/src/hooks/useCurrentUserProfile.ts",
          "operation": "create",
          "description": "Add a react-query hook that fetches backendInterface.getCallerUserProfile() and exposes loading states that properly reflect actor readiness (per authorization selected component guidance). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useUserRole.ts",
          "operation": "create",
          "description": "Add a hook to fetch backendInterface.getCallerUserRole() and/or backendInterface.isCallerAdmin() for UI-level role gating (e.g., admin reports navigation visibility). Use the authorization selected component patterns; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Persistent, explicit non-affiliation disclaimer visible before login and accessible after login.",
      "acceptanceCriteria": [
        "Disclaimer text is visible on a public landing/login screen before sign-in.",
        "Disclaimer text is available after sign-in in an About/Disclaimer section.",
        "User-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/disclaimer.ts",
          "operation": "create",
          "description": "Add a single source of truth for the non-affiliation disclaimer text (English), explicitly stating the app is not created by, endorsed by, or affiliated with the U.S. Army or the DoD."
        },
        {
          "path": "frontend/src/pages/PublicLanding.tsx",
          "operation": "create",
          "description": "Create a public landing/login screen that shows the non-affiliation disclaimer text prominently and provides Internet Identity sign-in entry. Use the authorization selected component login patterns for II; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SettingsAbout.tsx",
          "operation": "modify",
          "description": "Display the disclaimer text post-login within the About/Disclaimer section, along with guidance that it can be reviewed any time."
        },
        {
          "path": "frontend/src/router.tsx",
          "operation": "modify",
          "description": "Wire the PublicLanding route as the default unauthenticated view and ensure it is reachable without sign-in."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Invite-only registration UX with clear errors when invite is invalid or user cap is reached.",
      "acceptanceCriteria": [
        "A user cannot complete registration without a valid invite code.",
        "Backend enforces a maximum of 45 registered users (rejects registration beyond the cap).",
        "Frontend shows a clear English error message when invite code is invalid or the cap has been reached."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/onboarding/OnboardingFlow.tsx",
          "operation": "modify",
          "description": "Add invite code input + validation messaging and call backendInterface.acceptInvite(username, inviteCode). Parse and present backend errors as clear English messages for invalid invite and capacity reached. Use the authorization selected component error-handling guidance for trap messages; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PublicLanding.tsx",
          "operation": "modify",
          "description": "Add copy and UI cues indicating invite-only access and that a valid invite code is required at first registration (without revealing any secret-generation mechanics)."
        },
        {
          "path": "frontend/src/hooks/useInviteOnlyRegistration.ts",
          "operation": "create",
          "description": "Create a small hook/wrapper around backendInterface.acceptInvite() to standardize loading state and error mapping into user-friendly English messages."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Private journaling CRUD with optional explicit sharing to a squad group; shared entries visible read-only to group members and removable from sharing without deleting the private copy.",
      "acceptanceCriteria": [
        "User can create, view, edit, and delete their own journal entries.",
        "Journal entries are private unless the user explicitly shares an entry to a group.",
        "When shared, group members can view the entry; non-members cannot.",
        "Unsharing removes the entry from group visibility without deleting the user’s private copy."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Journal.tsx",
          "operation": "create",
          "description": "Create a journaling screen for authenticated users with list + editor flows, using backendInterface.getMyJournalEntries(), addJournaling(), updateJournaling(), deleteJournaling(), and getJournaling() for refresh. Include share controls that can set isShared and optionally attach a squadGroup id, with explicit user action required to share."
        },
        {
          "path": "frontend/src/pages/SquadSharedEntries.tsx",
          "operation": "create",
          "description": "Create a read-only shared-entries view within a selected squad context using backendInterface.getSharedSquadEntries(squadId). Ensure UI clearly indicates shared vs private content and prevents edits by non-authors."
        },
        {
          "path": "frontend/src/components/journal/JournalEditor.tsx",
          "operation": "create",
          "description": "Create a reusable journal editor component (title/content) that supports create + edit, plus a share section to toggle sharing and select a squad group (when available). Ensure unsharing only updates sharing fields and does not delete the entry."
        },
        {
          "path": "frontend/src/hooks/useJournalEntries.ts",
          "operation": "create",
          "description": "Add react-query hooks for fetching and mutating journaling data with cache invalidation for my entries and shared squad entries."
        },
        {
          "path": "frontend/src/router.tsx",
          "operation": "modify",
          "description": "Wire Journal and SquadSharedEntries into the authenticated navigation/routes so they are reachable and not orphaned."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Invite-only squad groups with up to 45 members: create, join by code, leave, rotate invite code, and view member list with usernames.",
      "acceptanceCriteria": [
        "A signed-in user can create a group and becomes its owner/admin.",
        "Users can join a group only via an invite code; groups are not publicly discoverable.",
        "Group member count is enforced by the backend with a maximum of 45.",
        "Group owner can rotate (invalidate) the invite code.",
        "Members can leave a group; owner can remove a member."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Squads.tsx",
          "operation": "create",
          "description": "Create a squads screen that supports create group (backendInterface.createSquadGroup), join by invite code (backendInterface.joinSquadGroup), leave group (backendInterface.leaveSquadGroup), view group details (backendInterface.getSquadGroup), and view members with usernames (backendInterface.getSquadMembers). Show clear English errors for invalid codes/full groups based on backend responses."
        },
        {
          "path": "frontend/src/components/squads/SquadInvitePanel.tsx",
          "operation": "create",
          "description": "Create an owner-only invite panel that shows current invite code (from squad data) and allows rotating it via backendInterface.rotateSquadInviteCode(squadId), with copy-to-clipboard UX."
        },
        {
          "path": "frontend/src/components/squads/SquadMembersList.tsx",
          "operation": "create",
          "description": "Create a members list UI that displays usernames from backendInterface.getSquadMembers(squadId). Include an owner-only 'remove member' control that is wired defensively: invoke a backend capability only if present at runtime (e.g., feature-detect on actor casted to unknown/any) so the UI can be completed when the capability exists, while still compiling with the current typed interface."
        },
        {
          "path": "frontend/src/hooks/useSquads.ts",
          "operation": "create",
          "description": "Add react-query hooks for squad group operations and member list fetching, including cache invalidation after join/leave/rotate."
        },
        {
          "path": "frontend/src/router.tsx",
          "operation": "modify",
          "description": "Wire Squads into authenticated routes/navigation, and ensure the shared entries view can be reached from a selected squad context."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Doctrine-informed content modules area with citations, interpreted exercises, and prompts that prefill new journal entries.",
      "acceptanceCriteria": [
        "App includes a Content/Modules area with categories covering the listed focus areas.",
        "Each module supports two content types: (1) quote/summarize with citation fields (source title + reference string), and (2) interpreted guidance/exercise text.",
        "Each module includes at least one prompt that can be used to create a new journal entry from the module (prefills the editor)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/modules.ts",
          "operation": "create",
          "description": "Add a curated static module dataset (English) organized by categories: mental readiness, resilience, decision-making, communication, team cohesiveness, and identity/Army values in daily life. For each module include (a) quote/summarize with citation fields (source title + reference string) and (b) interpreted guidance/exercise text, plus at least one journaling prompt."
        },
        {
          "path": "frontend/src/pages/Modules.tsx",
          "operation": "create",
          "description": "Create a Modules screen that renders categories and module detail views from the static dataset, displaying citations and interpreted exercises. Provide a 'Start reflection' action that navigates to Journal with editor prefilled from the chosen prompt."
        },
        {
          "path": "frontend/src/pages/Journal.tsx",
          "operation": "modify",
          "description": "Add support for optional navigation state/query that prefills the journal editor title/content from a selected module prompt."
        },
        {
          "path": "frontend/src/router.tsx",
          "operation": "modify",
          "description": "Wire Modules into authenticated routes/navigation and ensure module-to-journal prefill navigation works."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Community guidelines accessible pre/post login, reporting flow for shared content or users, and admin/moderator review UI for reports.",
      "acceptanceCriteria": [
        "Community Guidelines page is accessible pre-login and post-login.",
        "Within group-shared entries, a user can submit a report with required reason and optional notes.",
        "Reports are stored in the backend with reporter, target (entry/user), timestamp, and status (open/closed) and are not visible to non-admins.",
        "Admin/moderator view lists reports and allows marking them resolved/closed with an internal note."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Guidelines.tsx",
          "operation": "create",
          "description": "Create a Community Guidelines page that fetches and displays the guidelines text from backendInterface.getGuidelines() and is reachable both pre-login and post-login (read-only)."
        },
        {
          "path": "frontend/src/components/reports/ReportDialog.tsx",
          "operation": "create",
          "description": "Create a reporting dialog usable from shared entries and from squad member lists. Require a reason field and allow optional details, then submit via backendInterface.reportAbuse(reportedEntry, reportedUser, reason, details)."
        },
        {
          "path": "frontend/src/pages/SquadSharedEntries.tsx",
          "operation": "modify",
          "description": "Add a 'Report' action on shared entries that opens ReportDialog prefilled with the reported entry id."
        },
        {
          "path": "frontend/src/components/squads/SquadMembersList.tsx",
          "operation": "modify",
          "description": "Add a 'Report user' action for members that opens ReportDialog prefilled with the reported user principal."
        },
        {
          "path": "frontend/src/pages/AdminReports.tsx",
          "operation": "create",
          "description": "Create an admin/moderator reports review screen that lists reports using backendInterface.getAllReports(), allows viewing details via backendInterface.getReport(reportId), and supports resolving/closing via backendInterface.updateReportStatus(reportId, status). Gate access using backendInterface.isCallerAdmin() and show an AccessDenied state to non-admins. Use the authorization selected component patterns for admin-only UI gating and error handling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useReports.ts",
          "operation": "create",
          "description": "Add react-query hooks for admin report listing/detail and status updates, including cache invalidation after updates."
        },
        {
          "path": "frontend/src/router.tsx",
          "operation": "modify",
          "description": "Wire Guidelines as both a public route and an authenticated route entry, and wire AdminReports behind an admin-only guard so it is reachable only for admins."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Apply a coherent reflective theme across the app (non-agency branded), avoiding blue/purple as primary colors and visually distinguishing private vs shared areas.",
      "acceptanceCriteria": [
        "App uses a consistent theme (colors, typography, layout) across landing, journaling, groups, and modules screens.",
        "Primary brand colors are not blue or purple.",
        "UI clearly distinguishes private journal area vs shared group area through layout and visual hierarchy (without adding new features)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "create",
          "description": "Create global Tailwind/CSS variables and base styles used by the app to establish a calm, reflective theme with a non-military-agency feel. Set primary brand tokens to non-blue/non-purple hues (e.g., earth/green/neutral) and ensure consistent typography and spacing across screens."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Adjust Tailwind theme extensions if needed to support the chosen non-blue/non-purple palette and consistent typography/spacing tokens used in the UI."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "create",
          "description": "Create an authenticated layout shell with consistent header/nav and content container spacing. Use visual hierarchy to distinguish private journaling sections vs shared squad sections (e.g., different section headers, background surfaces, badges) without adding new features."
        },
        {
          "path": "frontend/src/pages/Journal.tsx",
          "operation": "modify",
          "description": "Apply the global theme and add clear visual separation between private entries controls and sharing controls/indicators (e.g., private vs shared badges), without changing underlying functionality."
        },
        {
          "path": "frontend/src/pages/SquadSharedEntries.tsx",
          "operation": "modify",
          "description": "Apply the global theme to shared entries with a distinct shared-area styling hierarchy (consistent with the app shell) to clearly differentiate from private journaling."
        },
        {
          "path": "frontend/src/pages/PublicLanding.tsx",
          "operation": "modify",
          "description": "Apply the global theme to the public landing screen so branding is consistent and explicitly non-agency-branded, while keeping the disclaimer prominent."
        }
      ]
    }
  ]
}