{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Mobile drawer: instant close on nav selection + non-blocking overlay (md breakpoint)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "On <md, close the mobile sidebar drawer immediately on any menu item click (before route navigation completes) so main content is instantly visible and interactive.",
      "acceptanceCriteria": [
        "On screens <768px, opening the hamburger menu and tapping any nav item (e.g., Life Lessons, Journal, Dashboard, etc.) closes the drawer immediately.",
        "After the drawer closes, the selected page content (videos/filters/search where applicable) is fully visible and clickable with no sidebar overlay blocking interaction.",
        "Desktop behavior at >=768px remains unchanged (sidebar persistent; no auto-close requirement)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Adjust mobile nav click handling so the drawer state closes synchronously/immediately before triggering navigation (e.g., force state flush prior to navigate) for <md only, keeping >=md behavior unchanged. Ensure this applies to all sidebar items, including Dashboard refresh behavior when already on '/'. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Prevent the closed mobile drawer/backdrop from capturing pointer events or blocking scroll/taps after closing.",
      "acceptanceCriteria": [
        "When the mobile drawer is closed, all main content areas can be scrolled and interacted with normally (no invisible overlay capturing touches/clicks).",
        "The drawer/backdrop layering does not interfere with the header controls after closing (hamburger is usable again)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Ensure the off-canvas drawer cannot intercept interactions when closed by removing it from hit-testing (e.g., pointer-events-none when closed) and/or conditionally rendering/unmounting the drawer/backdrop when not open. Confirm z-index/layering so header and main content regain full interactivity immediately after closing. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "On <md, show a semi-transparent backdrop only while the drawer is open; tapping outside closes the drawer immediately.",
      "acceptanceCriteria": [
        "On screens <768px, opening the drawer shows a semi-transparent backdrop behind it.",
        "Tapping the backdrop closes the drawer immediately.",
        "On >=768px, no mobile backdrop is shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Add/verify the mobile-only backdrop behavior: render backdrop only when the drawer is open, ensure it sits behind the drawer, and closes the drawer immediately on tap/click. Keep backdrop hidden at >=md. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Preserve existing UI/UX (dark theme, icons, labels, and route paths) while implementing only the mobile drawer behavior fixes.",
      "acceptanceCriteria": [
        "No visual/theme regressions are introduced outside of the mobile drawer open/close and backdrop behavior.",
        "All existing navigation items and route paths remain the same (especially `/mental-performance/life-lessons`)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Implement the drawer fixes without changing nav labels/paths (especially the Life Lessons path), icons, theme styling, or desktop sidebar behavior at >=md. Keep the existing layout structure and only adjust mobile drawer/backdrop interaction and layering. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}