{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix AppShell layering and pointer-event handling for drawer/backdrop and dropdown menus",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove any closed-drawer/backdrop hitboxes and ensure layout wrappers do not block pointer events for main content interactions.",
      "acceptanceCriteria": [
        "When the mobile drawer is closed, all interactive elements in main content pages (including /mental-performance/life-lessons) are clickable and receive pointer events normally.",
        "There is no persistent full-screen overlay/backdrop element remaining mounted or intercepting clicks after the drawer closes.",
        "No parent wrappers added for layout purposes prevent click handlers from firing on nested interactive elements (buttons, links, cards, filter controls)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Audit the AppShell layout tree for any fixed/absolute layers that can intercept clicks when the drawer is closed; refactor the mobile drawer/backdrop so that when closed they are fully unmounted (or otherwise guaranteed to have zero hitbox and pointer-event interception), while keeping the existing desktop sidebar behavior unchanged."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make sidebar/main-content sibling layout predictable and ensure dropdown surfaces render above other layers without overflow clipping.",
      "acceptanceCriteria": [
        "Sidebar dropdown menus (including the existing account dropdown) appear above the sidebar/drawer and main content (effective z-index), and remain clickable on both mobile and desktop.",
        "Dropdown/overlay surfaces are not clipped by parent containers (e.g., due to `overflow-hidden`) in normal sidebar-open scenarios.",
        "The layout remains: sidebar/drawer and main content are sibling regions; overlays/backdrops are layered predictably (backdrop below drawer, drawer below dropdown content where applicable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Adjust AppShell stacking contexts (z-indexes and positioning) so the sidebar and main content remain sibling regions and any overlay/menu layers (drawer, backdrop, dropdowns) stack predictably; ensure dropdown menu triggers/containers are not placed inside overflow-clipping wrappers in a way that prevents interaction."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Strengthen global layering safeguards for Radix/shadcn dropdown/popover surfaces so they reliably appear above drawer/backdrop layers (e.g., enforce a high z-index on the Radix popper wrapper) while avoiding changes to files under frontend/src/components/ui."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure mobile drawer backdrop only exists while open, closes on backdrop click, and drawer interactions never trigger backdrop dismissal.",
      "acceptanceCriteria": [
        "When the mobile drawer is open, tapping/clicking the backdrop closes it reliably.",
        "When the mobile drawer is open, interacting with items inside the drawer (nav buttons, account dropdown trigger, Settings/Guidelines links, Field Mode toggle) does not accidentally trigger backdrop dismissal unless the user actually taps the backdrop.",
        "When the mobile drawer is closed, it has no hitbox (no click interception) and does not block interaction with main content."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Refine mobile drawer/backdrop event handling: keep the backdrop mounted only while open and bind dismissal to backdrop interaction; add explicit event-stopping on the drawer container (e.g., onPointerDown/onClick stopPropagation) to prevent any dismissal logic from being triggered by drawer interactions; keep the existing desktop sidebar persistent behavior at md and above."
        }
      ]
    }
  ]
}