{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "DAGGER - Holistic Health and Fitness is an Internet Computer (Motoko canister) + React web app for soldiers’ personal development. It provides Internet Identity sign-in, open account registration (username only) with a 45-user cap, onboarding that requires accepting a non-affiliation disclaimer and community guidelines, private journaling with optional sharing to small invite-code-based groups, doctrine-informed learning modules that deep-link into prefilled journal reflections, and an abuse reporting + admin moderation workflow.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication with persisted delegation",
      "synonyms": [
        "II login",
        "AuthClient",
        "DelegationIdentity"
      ],
      "description": "Provides an InternetIdentityProvider that initializes an AuthClient, restores a stored delegation on reload, exposes login/logout and status flags, and logs in via a configured II provider with ~30-day maxTimeToLive.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Identity-aware canister actor creation",
      "synonyms": [
        "useActor",
        "Authenticated actor",
        "Anonymous actor"
      ],
      "description": "Creates an anonymous backend actor when unauthenticated and an identity-bound actor when authenticated; actor instances are cached via React Query and re-created when the identity principal changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Access control initialization with secret token bootstrap",
      "synonyms": [
        "Admin bootstrap token",
        "CAFFEINE_ADMIN_TOKEN",
        "_initializeAccessControlWithSecret"
      ],
      "description": "On authenticated actor creation, calls a backend initializer that reads an environment variable token and compares it with a user-provided secret to optionally assign the first admin; otherwise assigns user role.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Secret parameter handling via URL hash + session storage",
      "synonyms": [
        "getSecretParameter",
        "hash secret extraction",
        "session persisted token"
      ],
      "description": "Implements utilities to read sensitive parameters from the URL hash (not query string), persist them in sessionStorage, and remove them from the URL via replaceState to reduce accidental leakage.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Role-based access control (RBAC) API",
      "synonyms": [
        "AccessControl",
        "isCallerAdmin",
        "getCallerUserRole"
      ],
      "description": "Backend maintains per-principal roles (guest/user/admin) and exposes APIs to query caller role, check admin status, and assign roles (admin-only). Backend methods gate access using hasPermission/isAdmin checks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Open registration with username uniqueness and capacity cap",
      "synonyms": [
        "registerUser",
        "account creation"
      ],
      "description": "Allows any authenticated user to register by choosing a username (no global invite code). Enforces unique usernames and caps total registered users to 45.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Onboarding flow: registration + disclaimer/guidelines acceptance",
      "synonyms": [
        "OnboardingFlow",
        "acceptDisclaimer"
      ],
      "description": "Two-step onboarding UI collects a username, then requires users to accept a disclaimer and community guidelines before the app grants access to core features; acceptance is persisted via acceptDisclaimer.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "User profile storage and retrieval",
      "synonyms": [
        "UserProfile",
        "getCallerUserProfile",
        "Settings & About"
      ],
      "description": "Stores a per-principal profile (username, joinedAt, disclaimerStatus, inviteCode placeholder) and provides APIs to fetch/save profiles. Frontend uses the caller profile to gate onboarding and to display profile info.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Private journaling CRUD with onboarding gating",
      "synonyms": [
        "Journal entries",
        "Journaling"
      ],
      "description": "Backend supports creating, listing, updating, and deleting journal entries owned by the caller. All journaling APIs require the caller to be a registered user who completed onboarding (disclaimer accepted).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Journal editor UI with optional group sharing",
      "synonyms": [
        "JournalEditor",
        "Share toggle"
      ],
      "description": "Frontend journal editor supports create/edit/delete, validation, and an optional share-to-group toggle with group selection; shared entries become visible to members of the selected group.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Invite-code-based groups (create/join/leave/view/members/rotate)",
      "synonyms": [
        "Squad groups",
        "Groups",
        "Join code"
      ],
      "description": "Backend implements group creation with a creator-chosen join code, joining by join code, leaving (owner cannot leave), fetching group details and member lists (member-only or admin), and rotating the join code (owner-only). Group membership is capped at 45 members.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Groups UI: list, create, and join",
      "synonyms": [
        "Groups page",
        "Create group dialog",
        "Join group dialog"
      ],
      "description": "Provides a Groups page that lists the user’s groups and includes dialogs to create a group (requires join code) and join an existing group by join code, with user-friendly error handling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Group detail page with shared entries, members, invite code tools, and reporting",
      "synonyms": [
        "GroupSharedEntries",
        "Shared feed",
        "Members tab"
      ],
      "description": "Group detail UI shows shared entries and a members list. Owners can copy/rotate the join code; non-owners can leave. Users can report other members’ shared entries via an embedded reporting dialog.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Learning modules library with reflection deep-links",
      "synonyms": [
        "Modules",
        "Reflection prompts",
        "Prefilled journaling"
      ],
      "description": "Frontend ships doctrine-informed learning modules organized by category; each module includes quotes/interpretations and reflection prompts that navigate to journaling with prefilled title/content (including a Sleep Performance category).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Community guidelines endpoint and UI page",
      "synonyms": [
        "getGuidelines",
        "Guidelines page"
      ],
      "description": "Backend provides a guidelines text endpoint; frontend includes a Guidelines page and also presents guidelines during onboarding.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Abuse reporting submission system",
      "synonyms": [
        "reportAbuse",
        "ReportDialog"
      ],
      "description": "Users can submit abuse reports for a shared journal entry and/or a user, selecting a reason and optional details. Backend validates that reported entries are shared and that reports involve users sharing a group context.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Admin moderation console for reports",
      "synonyms": [
        "AdminReports",
        "getAllReports",
        "updateReportStatus"
      ],
      "description": "Admins can view all reports, see status badges (open/in review/resolved), sort with open reports prioritized, and update report status from the UI via admin-only backend methods.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Authenticated app shell with navigation, theming, and logout",
      "synonyms": [
        "AppShell",
        "Navigation header",
        "next-themes"
      ],
      "description": "Provides the main authenticated layout with header navigation (Journal/Groups/Modules), mobile drawer, user dropdown (Guidelines, Settings, conditional Admin Reports), theme support, and logout that clears identity and React Query cache.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Backend state migration for removing legacy global invite code fields",
      "synonyms": [
        "migration.mo",
        "state migration"
      ],
      "description": "Includes a migration module that transforms an older actor state into the current state shape by dropping legacy global invite code and used-invite-codes fields while preserving existing user, journal, group, and report data.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-fix-authenticated-app-initialization-so-the-frontend-can-create-a-logged-in-actor-even-when-the-admin-bootstrap-secret-is-not-present-specifically-do-not-let-useactor-block-or-crash-the-app-if-initializeaccesscontrolwithsecret-traps-e-g-missing-empty-caffeineadmintoken-or-missing-backend-env-token-instead-continue-with-a-usable-authenticated-actor-and-surface-a-clear-error-message-in-the-ui-only-if-the-failure-prevents-core-user-flows",
      "title": "Fix authenticated app initialization so the frontend can create a logged-in actor even when the admin bootstrap secret is not present. Specifically: do not let `useActor` block or crash the app if `_initializeAccessControlWithSecret` traps (e.g., missing/empty `caffeineAdminToken` or missing backend env token); instead, continue with a usable authenticated actor and surface a clear error message in the UI only if the failure prevents core user flows.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-user-visible-error-state-for-the-post-login-profile-load-authorization-step-so-that-if-getcalleruserprofile-or-other-initial-authenticated-calls-fails-the-ui-shows-an-english-message-and-a-retry-action-instead-of-appearing-to-not-open",
      "title": "Add a user-visible error state for the post-login profile load/authorization step so that if `getCallerUserProfile` (or other initial authenticated calls) fails, the UI shows an English message and a retry action instead of appearing to not open.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Remove any global/invite-code gate for initial app access; allow anyone to create an account and use the core app, while keeping invite codes only for joining/creating groups.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Fix open registration and onboarding by updating backend authorization logic so a newly authenticated (but not yet registered) user can reach onboarding and successfully register. At minimum: (1) `registerUser` must not call an admin-only role-assignment path that traps for normal users; it must grant the caller the `#user` role in a way that works for self-registration, and (2) `getCallerUserProfile` must not trap for users who are authenticated but not yet registered; it should return `null` in that case so the frontend can show the onboarding flow.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Internet Computer architecture: a Motoko canister exposes a Candid API consumed by a typed frontend actor.",
    "Authorization uses a Motoko mixin (MixinAuthorization) backed by an AccessControl state module implementing RBAC (guest/user/admin).",
    "Frontend authentication is implemented with @dfinity/auth-client (Internet Identity) and long-lived DelegationIdentity (30 days).",
    "Frontend data access is centralized in TanStack React Query hooks (queries/mutations) with explicit cache invalidation after writes.",
    "Actor creation is identity-aware (anonymous vs authenticated) and performs access-control initialization on authenticated actor creation.",
    "Client routing uses TanStack Router; the root route gates between Public Landing, Onboarding, and the authenticated AppShell.",
    "UI stack: Tailwind CSS + shadcn/ui components, lucide icons, next-themes for light/dark mode, and sonner for toasts.",
    "Sensitive bootstrap values (admin token) are passed via URL hash and persisted in sessionStorage, then removed from the URL to reduce leakage."
  ],
  "known_issues": [
    "Backend registerUser calls AccessControl.assignRole (admin-only) with the registering caller; this likely traps for non-admin users and can break open registration.",
    "Canister state is not upgrade-safe: runtime Maps/vars are not stored in stable variables with preupgrade/postupgrade hooks, so upgrades may lose state (migration module exists but stability is not evident here).",
    "Group join code validation is case-sensitive on the backend (group.inviteCode == inviteCode) despite frontend comments claiming case-insensitive backend validation.",
    "rotateSquadInviteCode is not a true rotation: invite codes are deterministically generated from squadId, so rotating may produce the same value; codes are also predictable.",
    "joinSquadGroup performs a linear scan over all groups to find a matching invite code (O(n)), which will not scale.",
    "Frontend “My Groups” list is derived by scanning the caller’s journal entries for squadGroup references rather than querying actual membership; membership may not appear until a journal entry is associated.",
    "GroupSharedEntries incorrectly uses UserProfile.joinedAt as if it were a Principal to match authors/owners/me, leading to “Unknown” authors and incorrect badges.",
    "Guidelines page fetches guidelines from the backend but renders hard-coded guideline content instead of the fetched string.",
    "_initializeAccessControlWithSecret traps if the CAFFEINE_ADMIN_TOKEN env var is not set; the frontend calls this during authenticated actor creation, risking total app failure in misconfigured deployments.",
    "reportAbuse does not enforce that at least one of reportedEntry or reportedUser is provided, allowing a targetless report if a client bypasses UI validation."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "DAGGER - Holistic Health and Fitness",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}