{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Mobile-first navigation update: replace permanent left sidebar with a collapsible full-width drawer opened via a hamburger icon, with semi-transparent scrim and auto-close behaviors; drawer remains collapsible on all screen sizes.",
  "architectural_notes": [
    "Navigation drawer behavior decisions: collapsible on all screen sizes; full-width drawer on mobile; semi-transparent scrim behind open drawer; close on outside tap, close icon, or navigation selection."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-update-the-global-appshell-layout-to-replace-the-permanent-left-sidebar-with-a-mobile-first-collapsible-drawer-that-is-hidden-by-default-on-all-screen-sizes-and-opened-via-a-hamburger-menu-icon-in-the-top-left-of-a-persistent-header-top-bar",
      "title": "Update the global AppShell layout to replace the permanent left sidebar with a mobile-first collapsible drawer that is hidden by default on all screen sizes and opened via a hamburger menu icon in the top-left of a persistent header/top bar.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-the-drawer-interaction-behaviors-tapping-the-hamburger-opens-a-full-width-left-side-overlay-drawer-the-drawer-includes-a-close-x-control-tapping-outside-the-drawer-on-the-scrim-closes-it-selecting-any-navigation-menu-item-navigates-and-automatically-closes-the-drawer",
      "title": "Implement the drawer interaction behaviors: tapping the hamburger opens a full-width left-side overlay drawer; the drawer includes a close (X) control; tapping outside the drawer (on the scrim) closes it; selecting any navigation menu item navigates and automatically closes the drawer.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-main-content-area-uses-the-full-available-width-when-the-drawer-is-closed-and-ensure-drawer-scrim-layering-z-index-positioning-does-not-cause-overlap-glitches-or-prevent-main-content-scrolling-when-the-drawer-is-closed",
      "title": "Ensure the main content area uses the full available width when the drawer is closed, and ensure drawer/scrim layering (z-index/positioning) does not cause overlap glitches or prevent main content scrolling when the drawer is closed.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Replace permanent left sidebar with a mobile-friendly collapsible drawer: hamburger icon on all main screens; sidebar hidden by default; full-width slide-in overlay from left with semi-transparent scrim; close on outside tap, close icon, or menu selection; main content expands to full width; drawer remains collapsible on all screen sizes.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "projectName": "Convert permanent sidebar into collapsible full-width drawer with hamburger menu and scrim",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}