{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 6,
  "summary": "An invite-only personal development web app for service members built on the Internet Computer (Motoko canister backend + React frontend). Users authenticate with Internet Identity, register via a global invite code (hard-capped at 45 users), then complete onboarding by accepting a non-affiliation disclaimer and community guidelines. The core experience is private journaling with optional sharing to invite-only “squad” groups (max 45 members) plus a doctrine-informed learning modules library with reflection prompts that deep-link into the journal editor with prefilled text. The app includes community guidelines access, abuse reporting for shared squad entries/users, and an admin-only moderation console for reviewing and resolving reports.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication with persisted delegation (login/logout)",
      "synonyms": [
        "II auth",
        "Internet Identity sign-in"
      ],
      "description": "Users authenticate via Internet Identity using @dfinity/auth-client. The app loads any stored delegation on startup, supports interactive login, and logout clears identity and client state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor creation tied to identity + access-control initialization",
      "synonyms": [
        "Actor hook",
        "Auth bootstrap"
      ],
      "description": "Frontend creates an anonymous or authenticated canister actor (useActor). For authenticated sessions it initializes role assignment via _initializeAccessControlWithSecret using a secret read from the URL hash/sessionStorage, and invalidates/refetches dependent React Query caches when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Invite-only registration with global invite code and 45-user cap",
      "synonyms": [
        "Invite registration",
        "Global invite code"
      ],
      "description": "Registration is performed via acceptInvite(username, inviteCode). The backend enforces a maximum of 45 user profiles and validates the global invite code and username uniqueness.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Onboarding gate: disclaimer + community guidelines acceptance",
      "synonyms": [
        "Disclaimer acceptance",
        "Guidelines acceptance"
      ],
      "description": "After registration, users must accept the non-affiliation disclaimer (and UI-confirm guidelines agreement) before being considered fully onboarded and allowed to use core app features; backend gates most endpoints on disclaimer acceptance.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "User profile storage and retrieval (caller/self)",
      "synonyms": [
        "UserProfile",
        "Profile endpoint"
      ],
      "description": "Backend stores per-principal user profiles (username, joinedAt, inviteCode, disclaimer status). Frontend fetches the caller profile for gating and display in settings/about.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Private journaling CRUD",
      "synonyms": [
        "Journal entries",
        "Reflections"
      ],
      "description": "Users can create, list, edit, and delete personal journal entries. Entries include title/content/timestamp and are private by default; backend enforces author-only updates and deletes (admins may delete).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Optional sharing of journal entries to squad groups",
      "synonyms": [
        "Share to squad",
        "Shared feed"
      ],
      "description": "Journal entries can be marked shared and associated with a squad. Backend verifies the author is a member of the target squad; squad members can view shared entries for that squad.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Squad groups: create, join by invite code, view, leave, rotate invite code",
      "synonyms": [
        "Groups",
        "Squads"
      ],
      "description": "Users can create squads, join by invite code, view squad details/members (members-only), leave squads (non-owner), and squad owners can rotate the squad invite code. Backend enforces a max of 45 members per squad and membership-based visibility.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Squad shared entries and member list UI",
      "synonyms": [
        "Squad detail page",
        "Squad feed"
      ],
      "description": "Frontend provides a squad detail page with tabs for shared entries and members, plus owner invite-code copy/rotate controls and a leave-squad confirmation dialog for non-owners.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Learning modules library with doctrine citations and guided reflection prompts",
      "synonyms": [
        "Modules browser",
        "Guided prompts"
      ],
      "description": "Frontend ships structured learning modules organized by category, containing doctrine quotes (with citations) and interpretations, plus reflection prompts that deep-link into the Journal editor with prefilled title/content.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Stress vs. distress (eustress) learning content + high-performer inspired insights + tailored reflection prompt",
      "synonyms": [
        "Stress vs distress module content",
        "Eustress prompt"
      ],
      "description": "The Mental Readiness module includes additional content explaining eustress vs distress and paraphrased, attribution-style insights inspired by public high-performance figures (e.g., Wim Hof, David Goggins, Jocko Willink, Tom Brady, Michael Jordan, Mike Tyson, Joe Rogan, Shawn Ryan), plus a dedicated reflection prompt that prefills a structured stress inventory/action plan journal entry.",
      "reqIds": [
        "REQ-9",
        "REQ-10",
        "REQ-11"
      ],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Public landing page with disclaimer and invite-only messaging",
      "synonyms": [
        "Unauthenticated landing",
        "Marketing page"
      ],
      "description": "Unauthenticated users see a public landing experience describing the app, showing the non-affiliation disclaimer, and offering Internet Identity sign-in for invite-only access.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Community guidelines access",
      "synonyms": [
        "Guidelines page",
        "Community expectations"
      ],
      "description": "Frontend provides a Guidelines page accessible from the app shell; the backend also exposes a getGuidelines endpoint intended for displaying guideline text.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Abuse reporting for shared content/users",
      "synonyms": [
        "Report abuse",
        "Flag entry"
      ],
      "description": "Users can submit abuse reports against shared squad entries (and optionally users) with a required reason and optional details. Backend validates report targets (shared entry in a squad the reporter belongs to; reported user must share a squad).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Admin moderation console for reports (RBAC protected)",
      "synonyms": [
        "Admin Reports",
        "Moderation UI"
      ],
      "description": "Admin-only page lists all reports, sorts open reports first, displays metadata (reason/details/reporter/targets), and allows updating report status to In Review or Resolved. Backend enforces admin-only access for listing and status updates.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Application shell with responsive navigation and logout behavior",
      "synonyms": [
        "AppShell",
        "Navigation layout"
      ],
      "description": "Authenticated users use a responsive shell with primary navigation (Journal, Squads, Modules), user dropdown (Guidelines, Settings, Admin Reports when applicable), and logout that clears identity and React Query cache.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Centralized backend API hooks with cache invalidation",
      "synonyms": [
        "useQueries",
        "React Query API layer"
      ],
      "description": "Frontend wraps canister calls in typed React Query hooks for user profiles, invites, journaling, squads, guidelines, reporting, and admin operations with consistent loading states and cache invalidation strategies.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Tailwind + shadcn/ui design system with theme variables and dark mode",
      "synonyms": [
        "Design system",
        "Theming"
      ],
      "description": "UI styling uses Tailwind CSS, shadcn/ui components, and CSS variable color tokens. Dark mode is supported via next-themes with class-based toggling.",
      "reqIds": [],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Change the global registration invite code to \"dagger\" so the user can enter the app",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Update the backend global registration invite code so that `acceptInvite` only accepts the invite code \"dagger\" (replacing the current value), enabling users to register and enter the app with that code.",
      "reqIds": [
        "REQ-12"
      ],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Internet Computer architecture: Motoko canister exposes a Candid API consumed via a generated frontend actor (ICP agent).",
    "Role-based access control implemented via an AccessControl module and a MixinAuthorization mixin; admin bootstrapping depends on a canister env var token plus a client-provided secret.",
    "Frontend data layer uses TanStack React Query hooks for queries/mutations with cache invalidation and refetch on actor changes.",
    "Routing is implemented with TanStack Router; authenticated vs unauthenticated and onboarding gating is handled in the root route component.",
    "Authentication uses @dfinity/auth-client via a custom InternetIdentityProvider that persists delegation identities and provides login/logout lifecycle.",
    "Sensitive “admin token” is read from URL hash and persisted in sessionStorage; token is removed from the URL after extraction to reduce leakage.",
    "Backend state uses in-memory Map structures for user profiles, journal entries, squad groups, and reports with monotonic counters.",
    "UI is built with Tailwind CSS + shadcn/ui components; theming uses CSS variables (OKLCH tokens) with light/dark mode via next-themes.",
    "Learning content is static, shipped in the frontend as structured module definitions (quotes + interpretations + prompts).",
    "Moderation/reporting is end-to-end: user reports are persisted on-canister and admin workflows update report status."
  ],
  "known_issues": [
    "Invite code generation for squads is deterministic and predictable (seeded from squadId; not cryptographically secure); rotating an invite code often produces the same value.",
    "No stable persistence is implemented in the Motoko canister (no stable vars / preupgrade / postupgrade); canister upgrades will lose in-memory state.",
    "Frontend squad discovery (useGetMySquads) infers squads by scanning the caller’s journal entries; users who joined squads but have no entries linked to those squads may see an empty/incorrect squad list.",
    "SquadSharedEntries UI attempts to match principals using UserProfile.joinedAt (a timestamp) as if it were the principal, breaking author/member resolution and “Owner/You” labels.",
    "Guidelines page fetches guidelines from the backend but renders hard-coded guideline text; fetched data is unused/inconsistent with backend-provided guidelines string.",
    "Backend has unused/unfinished invite-related fields (inviteCodeExpiration, usedInviteCodes) suggesting planned invite expiration/one-time-code logic is not implemented.",
    "Authorization initialization traps if CAFFEINE_ADMIN_TOKEN is not set in the canister environment, which can prevent successful admin bootstrap behavior.",
    "Report creation does not enforce that at least one of reportedEntry/reportedUser is provided, allowing empty/targetless reports if the frontend is bypassed.",
    "Squad owners cannot leave their squad, and there is no implemented ownership transfer or squad deletion flow.",
    "Squad join searches all squads linearly by inviteCode; may become inefficient if the number of squads grows significantly."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "Invite-only soldier resilience app with private journaling, squad groups (max 45 users), doctrine-informed content, and reporting",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}