{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "An invite-only personal development web app for service members built on the Internet Computer (Motoko canister backend + React frontend). Users authenticate with Internet Identity, register via a global invite code (hard-capped at 45 users), complete onboarding by accepting a non-affiliation disclaimer and community guidelines, then use private journaling with optional sharing to small invite-only “squad” groups (max 45 members). The app also provides doctrine-informed learning modules (including stress vs. distress content with insights from public figures/high performers) with reflection prompts that prefill journal entries, community guidelines access, abuse reporting for shared content/users within squads, and an admin-only moderation UI to review and resolve reports.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication (login/logout) with persisted identity",
      "synonyms": [
        "II auth",
        "Internet Identity sign-in"
      ],
      "description": "Users authenticate using DFINITY Internet Identity via @dfinity/auth-client. The app loads any existing delegation on mount, supports explicit login, and logout clears identity and client state.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor creation and access-control initialization",
      "synonyms": [
        "Actor hook",
        "Access-control bootstrap"
      ],
      "description": "Frontend creates an anonymous or authenticated backend actor (useActor). For authenticated users it calls _initializeAccessControlWithSecret using a secret token from the URL hash/session to allow admin assignment; it also invalidates/refetches React Query caches when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Invite-only registration with global invite code and hard cap of 45 users",
      "synonyms": [
        "Invite-only onboarding",
        "User cap"
      ],
      "description": "Backend enforces a maximum of 45 registered users and requires a valid global invite code to register. Registration also enforces unique usernames and prevents creating the 46th user even if the UI is bypassed.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Two-step onboarding: invite + disclaimer/guidelines acceptance gating",
      "synonyms": [
        "Onboarding flow",
        "Disclaimer acceptance"
      ],
      "description": "After authentication, users must submit invite code + choose a username, then accept the non-affiliation disclaimer and agree to community guidelines before gaining access to the app shell.",
      "reqIds": [
        "REQ-1",
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "User profile model and profile/settings display",
      "synonyms": [
        "UserProfile",
        "Settings & About"
      ],
      "description": "Backend stores a UserProfile (username, joinedAt, inviteCode, disclaimerStatus). Frontend fetches the caller profile and displays profile info and disclaimer acceptance timestamp in Settings & About.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Private journaling with CRUD operations",
      "synonyms": [
        "Journal entries",
        "Reflection entries"
      ],
      "description": "Users can create, list, edit, and delete their journal entries. Entries are private by default and are displayed with timestamps and private/shared badges in the Journal page.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Optional sharing of journal entries to squad groups",
      "synonyms": [
        "Share to squad",
        "Shared entries feed"
      ],
      "description": "Journal entries can be explicitly marked shared and associated with a squad group. Backend enforces that users can only share to squads they belong to, and squad members can view the shared feed.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Squad groups: create, join by invite code, leave, view members, rotate invite code",
      "synonyms": [
        "Groups",
        "Squads"
      ],
      "description": "Users can create invite-only squads, join via invite code, view squad details and members, leave (non-owner), and (as owner) copy/rotate the squad invite code. Backend enforces max 45 members per squad and membership-based visibility.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Doctrine-informed learning modules with citations and reflection prompts",
      "synonyms": [
        "Modules browser",
        "Guided prompts"
      ],
      "description": "Frontend provides categorized learning modules with quoted doctrine excerpts + citations and interpreted guidance, plus reflection prompts that deep-link into the Journal editor with prefilled title/content.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Persistent non-affiliation disclaimer accessible pre- and post-login",
      "synonyms": [
        "Non-DoD disclaimer",
        "Disclaimer page content"
      ],
      "description": "A single-source disclaimer text is displayed prominently on the public landing page and within authenticated settings/about and onboarding flows.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Community guidelines access and abuse reporting",
      "synonyms": [
        "Guidelines",
        "Report abuse"
      ],
      "description": "Users can view community guidelines and submit abuse reports for shared squad entries or for users who share a squad, selecting a reason and optional details. Backend validates report targets (shared content and shared-group relationship).",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Admin moderation: view reports and update report status",
      "synonyms": [
        "Admin reports console",
        "Moderation UI"
      ],
      "description": "Admin-only UI lists all reports, sorts open items first, and allows marking reports as In Review or Resolved. Backend enforces admin-only access for report listing and status updates.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Coherent visual theme and responsive application shell",
      "synonyms": [
        "Design system",
        "AppShell navigation"
      ],
      "description": "Tailwind + shadcn/ui-based UI with a cohesive theme (CSS variable tokens, light/dark mode) and a responsive navigation shell (header, mobile menu, user dropdown, footer).",
      "reqIds": [
        "REQ-8"
      ],
      "version": 1
    },
    {
      "id": "feature-add-new-stress-related-learning-content-stress-vs-distress-eustress-vs-distress-as-additional-content-inside-an-existing-learning-module-in-frontend-src-content-modules-ts-do-not-create-a-new-module",
      "title": "Add new stress-related learning content (stress vs. distress / eustress vs. distress) as additional content inside an existing learning module in `frontend/src/content/modules.ts` (do not create a new module).",
      "reqIds": [
        "REQ-9"
      ],
      "version": 1
    },
    {
      "id": "feature-include-both-a-short-attributed-insights-quotes-and-b-general-summaries-inspired-by-public-high-performance-figures-covering-wim-hof-david-goggins-shawn-ryan-joe-rogan-tom-brady-michael-jordan-mike-tyson-and-jocko-willink-do-not-include-copyrighted-or-unverifiable-verbatim-quotes-use-paraphrased-attribution-style-statements-e-g-inspired-by",
      "title": "Include both (a) short attributed insights/quotes and (b) general summaries inspired by public high-performance figures, covering: Wim Hof, David Goggins, Shawn Ryan, Joe Rogan, Tom Brady, Michael Jordan, Mike Tyson, and Jocko Willink. Do not include copyrighted or unverifiable verbatim quotes; use paraphrased, attribution-style statements (e.g., “Inspired by …”).",
      "reqIds": [
        "REQ-10"
      ],
      "version": 1
    },
    {
      "id": "feature-add-at-least-one-new-reflection-prompt-to-the-same-existing-module-so-users-can-start-a-guided-journal-entry-from-the-module-with-prefilltitle-and-prefillcontent-specifically-tailored-to-applying-stress-vs-distress-concepts-and-influencer-inspired-practices",
      "title": "Add at least one new reflection prompt to the same existing module so users can start a guided journal entry from the module, with `prefillTitle` and `prefillContent` specifically tailored to applying stress-vs-distress concepts and influencer-inspired practices.",
      "reqIds": [
        "REQ-11"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add stress vs. distress content (incl. insights/quotes + summaries from high-performance public figures) into an existing learning module, with a reflection prompt that prefills a journal entry.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Internet Computer architecture: Motoko canister exposes a Candid interface consumed by a generated frontend actor (DFINITY/ICP agent).",
    "Role-based access control implemented via an AccessControl module and a MixinAuthorization mixin; admin determined by a secret token and first-time initialization.",
    "Frontend uses TanStack Router for routing and TanStack React Query for data fetching/mutations and cache invalidation.",
    "Authentication handled via a custom InternetIdentityProvider around @dfinity/auth-client with persisted delegation identity and explicit login/logout.",
    "Onboarding gating is implemented at the root route level: authenticated users without accepted disclaimer are forced through onboarding flow.",
    "Data model includes UserProfile, Journaling entries, SquadGroup (invite code + members), and Report objects; backend enforces membership-based access for shared content.",
    "UI built with Tailwind CSS + shadcn/ui components; theme uses CSS variables with OKLCH tokens and light/dark mode via next-themes.",
    "Admin token is passed client-side via URL hash “secret” extraction and stored in sessionStorage to reduce leakage (hash is cleared after extraction).",
    "For public-figure/third-party material, include citations/attribution where appropriate and avoid verbatim copyrighted passages; prefer summaries or short quotations within fair-use limits."
  ],
  "known_issues": [
    "Squad invite-code “rotation” is effectively non-functional: generateInviteCode() is deterministic from squadId/seed, so rotating typically produces the same code (and codes are predictable).",
    "generateInviteCode() is not cryptographically secure (seed-based, small alphabet, predictable), making invite codes guessable.",
    "No stable persistence is implemented in the Motoko canister (no stable vars/preupgrade/postupgrade); data may be lost on canister upgrade.",
    "Frontend squad listing (useGetMySquads) infers squads by scanning the user’s journal entries; users who joined a squad but have no entries referencing that squad may see an empty/incorrect squad list.",
    "SquadSharedEntries incorrectly maps members to principals using UserProfile.joinedAt instead of a principal field; this breaks author name resolution and owner/“you” labels.",
    "Guidelines page fetches guidelines from the backend but renders hard-coded text; fetched data is unused/inconsistent with backend guidelines string.",
    "Backend includes unused/unfinished variables (inviteCodeExpiration, usedInviteCodes) suggesting invite expiration/unique-code tracking is not implemented.",
    "Authorization initialization traps if CAFFEINE_ADMIN_TOKEN is not set in the canister environment, preventing startup of auth features.",
    "Squad owners cannot leave their own squad and there is no implemented ownership transfer or squad deletion flow."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "Invite-only soldier resilience app with private journaling, squad groups (max 45 users), doctrine-informed content, and reporting",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}