{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "DAGGER - Holistic Health and Fitness is an invite-only Internet Computer dapp (Motoko canister backend + React frontend) for service members focused on personal development. Users authenticate with Internet Identity, register via a global invite code (capacity capped at 45), must accept a non-affiliation disclaimer and community guidelines, then can create private journal entries with optional sharing into small invite-only “squad” groups. The app also includes a static learning-modules library with reflection prompts that deep-link into the journal editor, plus an abuse reporting system and an admin-only moderation console to manage reports.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication with persisted session",
      "synonyms": [
        "Internet Identity login",
        "II auth",
        "Delegation identity"
      ],
      "description": "Provides a React context for Internet Identity sign-in/out using @dfinity/auth-client, restores any existing authenticated delegation on app load, and exposes login status flags and errors to the UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Identity-aware backend actor creation and lifecycle",
      "synonyms": [
        "Actor hook",
        "Authenticated/anonymous actor"
      ],
      "description": "Creates an anonymous backend actor when unauthenticated and an identity-bound actor when authenticated; recreates the actor when the principal changes and triggers React Query invalidation/refetch for non-actor queries.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Secure secret token handling via URL hash + sessionStorage",
      "synonyms": [
        "Admin token via hash",
        "Secret URL parameter utilities"
      ],
      "description": "Extracts sensitive parameters (e.g., caffeineAdminToken) from the URL hash fragment only, persists them in sessionStorage for the session, and clears them from the URL to reduce leakage risk.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Role-based access control with admin bootstrap token",
      "synonyms": [
        "RBAC",
        "AccessControl",
        "Admin role"
      ],
      "description": "Backend tracks per-principal roles (#guest/#user/#admin). A one-time initialization assigns admin to the first caller presenting the correct token (from canister env var), while others become users; admin-only endpoints are enforced by role checks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Invite-only registration with global invite code and capacity limit",
      "synonyms": [
        "Accept invite",
        "Invite-gated onboarding"
      ],
      "description": "Users register via acceptInvite(username, inviteCode). Backend enforces a max user capacity (45), prevents re-registration, validates invite codes case-insensitively against a global code, and enforces username uniqueness.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Invite code normalization helper",
      "synonyms": [
        "Invite code sanitization",
        "Invite input normalization"
      ],
      "description": "Frontend normalizes invite codes by trimming whitespace before submitting; backend performs case-insensitive validation for global invite code registration.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Two-step onboarding flow (invite + disclaimer/guidelines acceptance)",
      "synonyms": [
        "Onboarding gate",
        "Disclaimer acceptance"
      ],
      "description": "Authenticated users who are not fully onboarded are routed into a two-step onboarding UI: enter invite code and username, then accept the disclaimer and agree to community guidelines before gaining access to app features.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "On-demand global invite code retrieval",
      "synonyms": [
        "Get Code button",
        "Fetch global invite code"
      ],
      "description": "Provides a manually-triggered query to fetch the global invite code (React Query enabled=false by default) and autofill the invite code input during onboarding.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "User profile storage and retrieval",
      "synonyms": [
        "UserProfile API",
        "Profile page data"
      ],
      "description": "Backend stores and serves a per-principal user profile (username, join time, invite code, disclaimer acceptance status). Frontend reads the caller profile to gate onboarding and populate Settings/About.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Private journaling CRUD",
      "synonyms": [
        "Journal entries",
        "Reflections CRUD"
      ],
      "description": "Users can create, list, update, and delete their own journal entries. Backend enforces that only the author (or admin for deletion) can modify entries.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Optional sharing of journal entries to squads",
      "synonyms": [
        "Share to squad",
        "Shared entries"
      ],
      "description": "Journal entries can be marked as shared and linked to a squad. Backend enforces that the author is a member of the target squad, and that shared feeds are visible only to squad members or admins.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Journal UI with editor, prefill support, and share controls",
      "synonyms": [
        "Journal page",
        "JournalEditor"
      ],
      "description": "Frontend provides a journal list with private/shared badges, entry editing, and a full editor that supports create/update/delete and optional squad sharing (toggle + squad selector). Editor can be prefilled from module prompts via route search params.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Squad group creation, joining, and leaving (backend)",
      "synonyms": [
        "Group management API",
        "Squads backend"
      ],
      "description": "Backend supports creating squads (owner + initial member), joining by invite code with capacity enforcement (45), retrieving squad details and member profiles (member-only), leaving squads (non-owner), and rotating invite codes (owner-only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Squad management UI (list, create, join)",
      "synonyms": [
        "My Squads page",
        "Create/join dialogs"
      ],
      "description": "Frontend page lists squads associated with the user and provides dialogs to create a new squad or join an existing squad by invite code, including user-friendly error messaging for invalid/full/already-member cases.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Squad detail UI: shared feed, members, invite code tools, leave action",
      "synonyms": [
        "Squad page",
        "Shared entries tab",
        "Members tab"
      ],
      "description": "Frontend squad detail page provides tabs for shared entries and member list, allows owners to copy/rotate invite codes, allows non-owners to leave the squad, and supports reporting shared entries.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Learning modules library with reflection deep-links",
      "synonyms": [
        "Modules browser",
        "Guided prompts"
      ],
      "description": "Frontend ships a categorized library of doctrine-informed learning modules (quotes + interpretations) with reflection prompts. Prompts deep-link to the journal page and prefill the editor content/title.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Community guidelines endpoint and UI page",
      "synonyms": [
        "Guidelines page",
        "Community expectations"
      ],
      "description": "Backend exposes a getGuidelines endpoint, and the frontend provides a Guidelines page accessible from the authenticated user menu.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Abuse reporting submission workflow",
      "synonyms": [
        "Report abuse",
        "Flag content"
      ],
      "description": "Users can submit abuse reports against a shared squad entry or a user, selecting a reason and optional details via a reusable ReportDialog component; backend validates report context (e.g., shared entry in a squad the reporter belongs to).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Admin-only report moderation console",
      "synonyms": [
        "Admin Reports",
        "Moderation UI"
      ],
      "description": "Admin users can view all reports, see status badges, sort with open reports prioritized, and update report status (open/inReview/resolved) through backend updateReportStatus.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Public landing page for unauthenticated users",
      "synonyms": [
        "Marketing landing",
        "Public home"
      ],
      "description": "Unauthenticated users see a public landing page describing the product, showing the disclaimer, and providing an Internet Identity sign-in call-to-action with basic login error handling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Branded UI theme system and assets",
      "synonyms": [
        "Tailwind theme tokens",
        "DAGGER branding"
      ],
      "description": "Frontend uses Tailwind with a tokenized OKLCH-based color system, shadcn/ui components, dark mode, and static branding assets (favicon, icon mark, wordmark) referenced in pages and index.html.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-onboarding-invite-step-ui-frontend-src-components-onboarding-onboardingflow-tsx-to-ensure-the-invite-code-sent-to-acceptinvite-is-normalized-consistently-and-to-reduce-user-error-trim-the-invite-code-before-submission-and-add-concise-helper-text-indicating-the-global-invite-code-is-not-case-sensitive",
      "title": "Update the onboarding invite step UI (`frontend/src/components/onboarding/OnboardingFlow.tsx`) to ensure the invite code sent to `acceptInvite` is normalized consistently and to reduce user error: trim the invite code before submission, and add concise helper text indicating the global invite code is not case-sensitive.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix global invite code gating so users can enter/preview the app; ensure code accepts intended value (\"Dagger\"/\"dagger\") and matches backend validation/normalization.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Integrate the provided dagger logo into the app UI (placement TBD: landing page/onboarding/header/favicon).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add stress vs distress content inspired by public figures (e.g., Wim Hof, David Goggins, Shawn Ryan, Joe Rogan, Tom Brady, Michael Jordan, Mike Tyson, Jocko Willink, etc.) into an existing learning module, including both quotes/insights and summaries plus a journaling reflection prompt deep-link.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Update backend global invite code validation in `backend/main.mo` so that `acceptInvite(username, inviteCode)` accepts the intended global invite code \"Dagger\" in a robust, user-friendly way by normalizing the user-provided invite code before comparison (at minimum: trim leading/trailing whitespace and compare case-insensitively). Ensure the comparison is performed against a similarly-normalized canonical global invite code.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Internet Computer architecture: Motoko canister exposes a Candid API consumed by a typed/generated frontend actor.",
    "Role-based access control (RBAC) is implemented in Motoko via an AccessControl module and mixed into the main actor with MixinAuthorization.",
    "Frontend authentication is encapsulated in a React context (InternetIdentityProvider) using @dfinity/auth-client and DelegationIdentity validation.",
    "Frontend backend access is centralized via TanStack React Query hooks (queries/mutations) with cache invalidation on mutations and actor changes.",
    "Actor creation is identity-aware (anonymous vs authenticated) and performs access-control initialization using a secret token from the URL hash/sessionStorage.",
    "Routing is implemented with TanStack Router and gates between Public Landing, Onboarding, and the authenticated AppShell layout.",
    "UI uses Tailwind CSS + shadcn/ui component primitives and supports system/light/dark themes via next-themes.",
    "Backend state uses in-memory Map structures with monotonic counters for IDs (journal entries, squads, reports)."
  ],
  "known_issues": [
    "Canister state is not persisted across upgrades (no stable variables / preupgrade / postupgrade); all data would be lost on upgrade.",
    "rotateSquadInviteCode is effectively non-rotating because invite codes are deterministically generated from squadId; calling rotate returns the same code for a given squad.",
    "Frontend “My Squads” list (useGetMySquads) derives squads by scanning the user’s journal entries rather than true membership, so a user can join a squad and not see it until they create/link an entry.",
    "SquadSharedEntries attempts to resolve authors/owners using UserProfile.joinedAt as if it were a Principal; since getSquadMembers returns profiles without principals, “By <username>”, “Owner”, and “You” badges may be incorrect.",
    "Guidelines page fetches guidelines from the backend but renders hard-coded guideline content; the backend-provided string is not displayed.",
    "MixinAuthorization traps if CAFFEINE_ADMIN_TOKEN is not set, which can prevent authenticated actor initialization and break app access.",
    "joinSquadGroup finds a squad by iterating all groups and matching inviteCode (linear scan), which may not scale well.",
    "Reporting allows both reportedEntry and reportedUser to be null if the frontend is bypassed, potentially creating “targetless” reports.",
    "Several backend constants appear unused (inviteCodeExpiration, usedInviteCodes), suggesting incomplete/abandoned functionality.",
    "Duplicate theme CSS files exist (frontend/index.css and frontend/src/index.css) with different token sets, which can cause confusion or inconsistent styling depending on build configuration."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "DAGGER - Holistic Health and Fitness",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}