{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "DAGGER (brand shown as “Resilience”; title “DAGGER - Holistic Health and Fitness”) is an offline-first React SPA for service members focused on interactive daily readiness tracking and coaching, private device-local journaling, mission-like learning modules, and offline self-awareness/resilience assessments (OCEAN, MBTI, DISC, Strengths, GAT-style). The core UX is public-first with no accounts/login, creates a device-scoped local UUID profile on first launch, and stores all personal data locally with graceful degradation when backend methods are unavailable. Scope now also includes a dedicated Sleep Performance pillar (treated as a performance domain) with sleep debt mapping, tactical sleep modes, caffeine timing, naps/controlled rest, and stress-related sleep support, plus optional stress/distress content inspired by public figures integrated into existing modules.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Device-scoped local profile (UUID) with onboarding/consent flags",
      "synonyms": [
        "LocalProfile",
        "dagger-local-profile",
        "device UUID profile"
      ],
      "description": "Creates/loads a device-local profile in localStorage containing a generated localUuid, optional display name/call sign fields, disclaimer/guidelines acceptance flags + timestamps, optional onboarding metadata, and createdAt. Includes update/reset helpers and cross-tab sync via the storage event.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Skippable onboarding flow (disclaimer + guidelines acknowledgement)",
      "synonyms": [
        "OnboardingFlow",
        "consent overlay"
      ],
      "description": "Non-blocking onboarding overlay collects optional display name and “what brought you here” selection and requires checking disclaimer and guideline acknowledgements to complete; users can skip and complete later via an in-app reminder banner.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "App shell with navigation, user menu, mobile sheet, and reset-local-data dialog",
      "synonyms": [
        "AppShell",
        "navigation header"
      ],
      "description": "Provides global layout with responsive navigation links (Dashboard, Journal, Groups, Missions, Assessments), a Field Mode toggle, user menu links (Guidelines, Settings & About), onboarding reminder banner, and a destructive confirmation dialog that resets all device-local data and profile state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Central localStorage data store scoped by localUuid with global reset",
      "synonyms": [
        "localDataStore",
        "resetAllLocalData"
      ],
      "description": "Central CRUD utilities for locally storing journals, daily readiness inputs, readiness streak state, mission progression, and assessment history under namespaced keys; includes a full reset function clearing all per-user keys.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Local-only journal CRUD with editor and mission reflection deep-link prefill",
      "synonyms": [
        "Journal",
        "JournalEditor",
        "private reflections"
      ],
      "description": "Journal list and editor support create/edit/delete with client-side validation and delete confirmation. Journal editor supports prefilled title/content passed via router search params (used by mission reflection prompts). Entries are labeled as local/private on-device.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Daily readiness logging (local-only) with scoring, explanations, and streak tracking",
      "synonyms": [
        "DailyDashboard",
        "useSubmitDailyInput",
        "readiness factors"
      ],
      "description": "Users log sleep, training load, stress, and pain via sliders. The app calculates readiness as 70% factor average + 30% streak bonus (up to 30 points), generates explanation text, stores daily inputs locally, and maintains streak/high-readiness-day counts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Readiness visualization, coaching actions, and gamification badges",
      "synonyms": [
        "ReadinessMeter",
        "CoachActionsCard",
        "GamificationCard"
      ],
      "description": "Dashboard renders readiness tiering (Optimized/Ready/Moderate/Degraded), factor breakdown progress bars, analysis text, prioritized actionable coaching guidance, streak display, and simple badges derived from streak length and readiness score.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Field Mode (low-noise UI) toggle with global styling adjustments",
      "synonyms": [
        "Field Mode",
        "tap-target mode"
      ],
      "description": "Persisted toggle that applies a global CSS class to simplify UI hierarchy, reduce visual noise, and enforce larger tap targets across controls for field usage.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Online/offline status detection for UX banners",
      "synonyms": [
        "useOnlineStatus",
        "navigator.onLine"
      ],
      "description": "Tracks browser connectivity using online/offline events and provides an isOnline flag used for dashboard messaging (offline banner, syncing banner, pending changes indicator).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Mission system data model (steps, choices, timed steps, win conditions, XP, side quests, unlock rules)",
      "synonyms": [
        "types/missions.ts",
        "Mission schema"
      ],
      "description": "Defines typed mission structures including briefing/decision/scenario/timed steps, scoring, win conditions, XP rewards, side quests and unlock rules. Includes rank tiers and helpers to compute rank progression from XP.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Mission library UI with locked/unlocked state and operator progression panel",
      "synonyms": [
        "Modules page",
        "MissionCard",
        "OperatorProgressPanel"
      ],
      "description": "Mission library organized by category tabs displays mission briefing, win conditions, XP reward, side quest counts, completion state, and lock reasons. Operator status panel shows XP, rank, progress-to-next-rank, and unlocked items.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Interactive mission runner with timed decisions, scoring, and debrief",
      "synonyms": [
        "MissionRunner",
        "MissionDebrief"
      ],
      "description": "Runs missions step-by-step, records decisions, supports timed steps with countdown and auto-choice on timeout, computes score/max score, calculates XP (full on pass / half on fail), and renders a debrief with win-condition evaluation and optional reflection CTA deep-linking to the Journal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Local-only mission progression persistence (XP, rank/tier, unlockables, mission history)",
      "synonyms": [
        "useMissionProgression",
        "dagger-mission-progression-*"
      ],
      "description": "Stores operator progression in localStorage per device UUID: accumulates XP, computes rank/tier, records mission history, and adds unlockable markers for completed side quests.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Mission unlock rules including assessment-driven gating (frontend-evaluated)",
      "synonyms": [
        "MissionUnlockRule",
        "assessment unlocks"
      ],
      "description": "Supports unlock gating by rank, readiness streak, mission completion, performance threshold, and assessment completion/outcome patterns. Assessment-based rules are evaluated in the MissionCard UI using local assessment history.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Offline assessments module (entry, run, results, history/trends, leader view)",
      "synonyms": [
        "Assessments",
        "AssessmentRun",
        "AssessmentResults",
        "AssessmentHistory",
        "AssessmentLeaderView"
      ],
      "description": "Provides an offline-first assessments module with routes to list assessments, run questionnaires, show results, view history and basic trends, and view leader-focused guidance based on locally stored results.",
      "reqIds": [
        "REQ-18",
        "REQ-21",
        "REQ-25"
      ],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Assessment definitions, deterministic scoring, and outcome briefing/scenario content",
      "synonyms": [
        "content/assessments.ts",
        "assessmentScoring",
        "OutcomeBriefingCards",
        "assessmentOutcomes"
      ],
      "description": "Implements placeholder questionnaires and deterministic scoring for OCEAN (dimensional), MBTI (type), DISC (dimensional), Strengths themes (dimensional), and GAT-style resilience (banded). Results render military-focused “what it measures / mission relevance / actionable insights” content as cards including interactive scenario choices.",
      "reqIds": [
        "REQ-19",
        "REQ-20"
      ],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Local assessment result storage, history, and trend deltas",
      "synonyms": [
        "useAssessments",
        "dagger-assessments-*"
      ],
      "description": "Stores assessment runs in localStorage per device UUID, provides history retrieval per assessment type, returns latest run, computes simple trend summaries (first vs latest outcome label and per-score deltas), and exposes helpers used for mission unlock logic.",
      "reqIds": [
        "REQ-21",
        "REQ-23"
      ],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Assessment completion rewards integrated into mission progression (XP grant pathway)",
      "synonyms": [
        "assessment XP reward",
        "progression rewards"
      ],
      "description": "Assessment completion grants XP by emitting a synthetic MissionResult into the mission progression system (e.g., +50 XP on completion) so progression UI updates without requiring a mission run.",
      "reqIds": [
        "REQ-22"
      ],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Optional backend connectivity via Internet Identity + canister actor hooks",
      "synonyms": [
        "InternetIdentityProvider",
        "useSafeActor",
        "useActor"
      ],
      "description": "Provides Internet Identity authentication context, creates anonymous or identity-bound DFINITY actors, and uses React Query to manage actor lifecycle. Actor changes trigger invalidation/refetch of dependent queries.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Backend-dependent groups, shared entries, abuse reporting, and admin moderation UIs (graceful offline degradation)",
      "synonyms": [
        "Groups",
        "GroupSharedEntries",
        "ReportDialog",
        "AdminReports"
      ],
      "description": "Frontend includes pages and React Query hooks for creating/joining/leaving groups, viewing group members and shared entries, submitting abuse reports, and reviewing/updating report statuses. UI disables actions and displays clear offline/unavailable messaging when backend support is missing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Community guidelines and disclaimer content surfaced in onboarding and settings",
      "synonyms": [
        "Guidelines page",
        "DISCLAIMER_TEXT"
      ],
      "description": "Includes an explicit non-affiliation disclaimer (OPSEC/privacy reminders) and a community guidelines page, with acknowledgement captured during onboarding and status visible in settings.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Motoko backend proof-of-concept: readiness APIs, user profile stubs, and RBAC mixin",
      "synonyms": [
        "backend/main.mo",
        "AccessControl",
        "MixinAuthorization"
      ],
      "description": "Motoko canister defines types and in-memory maps for user profiles, journaling, groups, reports, daily readiness inputs, and readiness state. Implements readiness calculation/storage and dashboard query, plus role-based access control initialization via an env-var admin token and role queries/assignment helpers (with several user-profile methods stubbed/trapping).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Invite/join code normalization utility",
      "synonyms": [
        "normalizeInviteCode",
        "join code trimming"
      ],
      "description": "Client-side normalization trims whitespace on invite/join codes before sending to backend; backend is expected to handle case-insensitive validation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Backend error message parsing for offline-first UX",
      "synonyms": [
        "parseBackendError",
        "offline-first error mapping"
      ],
      "description": "Parses backend/actor errors into user-friendly messages emphasizing offline availability and permission constraints without referencing authentication/sign-in flows.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-create-a-new-top-level-app-section-named-sleep-performance-that-is-clearly-separated-from-other-pillars-physical-training-mental-readiness-mission-performance-and-is-reachable-from-the-main-app-navigation-with-equal-prominence",
      "title": "Create a new top-level app section named \"Sleep Performance\" that is clearly separated from other pillars (Physical Training, Mental Readiness, Mission Performance) and is reachable from the main app navigation with equal prominence.",
      "reqIds": [
        "REQ-26"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-a-daily-sleep-performance-dashboard-that-displays-last-sleep-window-rolling-sleep-debt-estimated-cognitive-readiness-percentage-an-injury-risk-indicator-and-an-emotional-regulation-impact-indicator-with-soldier-credible-explanatory-language-e-g-based-on-your-sleep-reaction-time-and-decision-making-may-be-degraded-today",
      "title": "Implement a \"Daily Sleep Performance Dashboard\" that displays: last sleep window, rolling sleep debt, estimated cognitive readiness percentage, an injury risk indicator, and an emotional regulation impact indicator, with soldier-credible explanatory language (e.g., \"Based on your sleep, reaction time and decision-making may be degraded today.\").",
      "reqIds": [
        "REQ-27"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-daily-sleep-performance-flow-that-follows-check-in-analysis-action-and-persists-all-sleep-performance-data-locally-offline-first-device-scoped",
      "title": "Add a daily Sleep Performance flow that follows: check-in → analysis → action, and persists all Sleep Performance data locally (offline-first, device-scoped).",
      "reqIds": [
        "REQ-28"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-tactical-sleep-modes-as-a-selectable-setting-field-mode-garrison-mode-shift-cq-staff-duty-mode-high-stress-post-event-mode-each-mode-must-dynamically-adjust-guidance-on-sleep-duration-expectations-nap-strategy-caffeine-timing-and-wind-down-protocols",
      "title": "Implement \"Tactical Sleep Modes\" as a selectable setting: Field Mode, Garrison Mode, Shift/CQ/Staff Duty Mode, High-Stress/Post-Event Mode; each mode must dynamically adjust guidance on sleep duration expectations, nap strategy, caffeine timing, and wind-down protocols.",
      "reqIds": [
        "REQ-29"
      ],
      "version": 1
    },
    {
      "id": "feature-create-a-sleep-debt-readiness-mapping-system-that-tracks-cumulative-sleep-debt-and-converts-debt-into-quantified-performance-degradation-outputs-for-reaction-time-pt-injury-risk-emotional-volatility-and-judgment-errors-avoid-vague-language-quantify-impact-where-possible",
      "title": "Create a Sleep Debt → Readiness mapping system that tracks cumulative sleep debt and converts debt into quantified performance degradation outputs for: reaction time, PT injury risk, emotional volatility, and judgment errors (avoid vague language; quantify impact where possible).",
      "reqIds": [
        "REQ-30"
      ],
      "version": 1
    },
    {
      "id": "feature-add-pain-aware-sleep-optimization-with-optional-inputs-for-neck-pain-back-pain-and-nerve-symptoms-provide-sleep-positioning-logic-pillow-guidance-30-90-second-micro-routines-neck-jaw-nerve-prep-and-red-flag-alerts-for-worsening-neurologic-symptoms",
      "title": "Add \"Pain-Aware Sleep Optimization\" with optional inputs for neck pain, back pain, and nerve symptoms; provide sleep positioning logic, pillow guidance, 30–90 second micro-routines (neck/jaw/nerve prep), and red-flag alerts for worsening neurologic symptoms.",
      "reqIds": [
        "REQ-31"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-a-caffeine-stimulant-timing-engine-that-allows-logging-caffeine-sources-estimates-clearance-windows-and-recommends-last-intake-times-frame-caffeine-as-a-tool-not-a-vice",
      "title": "Implement a \"Caffeine & Stimulant Timing Engine\" that allows logging caffeine sources, estimates clearance windows, and recommends last intake times; frame caffeine as a tool, not a vice.",
      "reqIds": [
        "REQ-32"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-nervous-system-downshift-tool-that-provides-2-5-minute-pre-sleep-routines-using-non-spiritual-operational-language-and-includes-breathing-jaw-neck-release-and-grounding-cues",
      "title": "Add a \"Nervous System Downshift\" tool that provides 2–5 minute pre-sleep routines using non-spiritual, operational language and includes breathing, jaw/neck release, and grounding cues.",
      "reqIds": [
        "REQ-33"
      ],
      "version": 1
    },
    {
      "id": "feature-add-micro-naps-controlled-rest-guidance-with-10-20-30-90-minute-options-sleep-cycle-aligned-wakeup-guidance-and-post-nap-reactivation-guidance-normalize-naps-as-performance-tools",
      "title": "Add \"Micro-Naps & Controlled Rest\" guidance with 10/20/30/90-minute options, sleep-cycle–aligned wakeup guidance, and post-nap reactivation guidance; normalize naps as performance tools.",
      "reqIds": [
        "REQ-34"
      ],
      "version": 1
    },
    {
      "id": "feature-add-stress-related-sleep-disruption-support-with-optional-stigma-free-check-ins-for-nightmares-hypervigilance-racing-thoughts-and-startle-response-provide-normalization-grounding-tools-and-quiet-guidance-on-escalation-if-needed",
      "title": "Add \"Stress-Related Sleep Disruption Support\" with optional, stigma-free check-ins for nightmares, hypervigilance, racing thoughts, and startle response; provide normalization, grounding tools, and quiet guidance on escalation if needed.",
      "reqIds": [
        "REQ-35"
      ],
      "version": 1
    },
    {
      "id": "feature-create-command-safe-education-tiles-in-the-sleep-performance-section-with-short-shareable-factual-operational-neutral-tiles-including-sleep-deprivation-equals-intoxication-level-impairment-3-nights-5-hrs-increases-injury-risk-and-sleep-loss-degrades-marksmanship-and-judgment",
      "title": "Create \"Command-Safe Education Tiles\" in the Sleep Performance section with short, shareable, factual, operational, neutral tiles including: \"Sleep deprivation equals intoxication-level impairment\", \"3 nights <5 hrs increases injury risk\", and \"Sleep loss degrades marksmanship and judgment\".",
      "reqIds": [
        "REQ-36"
      ],
      "version": 1
    },
    {
      "id": "feature-integrate-sleep-performance-with-existing-gamification-patterns-by-adding-consistency-streaks-and-readiness-improvements-tied-to-sleep-behavior-plus-unlockable-sleep-optimization-tools-all-stored-locally-and-compatible-with-offline-first-behavior",
      "title": "Integrate Sleep Performance with existing gamification patterns by adding consistency streaks and readiness improvements tied to sleep behavior, plus unlockable sleep optimization tools (all stored locally and compatible with offline-first behavior).",
      "reqIds": [
        "REQ-37"
      ],
      "version": 1
    },
    {
      "id": "feature-provide-in-app-language-examples-written-for-soldiers-across-sleep-performance-dashboard-insights-mode-guidance-caffeine-guidance-nap-guidance-and-stress-disruption-support-and-ensure-the-section-consistently-frames-sleep-as-combat-readiness-not-wellness-recovery-lifestyle",
      "title": "Provide in-app language examples written for soldiers across Sleep Performance (dashboard insights, mode guidance, caffeine guidance, nap guidance, and stress disruption support) and ensure the section consistently frames sleep as combat readiness (not wellness/recovery/lifestyle).",
      "reqIds": [
        "REQ-38"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add dedicated Sleep Performance pillar (dashboard, sleep debt→readiness mapping, tactical sleep modes, pain-aware optimization, caffeine timing engine, nervous system downshift routines, naps/controlled rest, stress-related sleep disruption support, command-safe education tiles, gamification).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Integrate stress vs distress + stress-management content inspired by/including quotes & summaries from public figures (e.g., Wim Hof, David Goggins, Shawn Ryan, Joe Rogan, Tom Brady, Michael Jordan, Mike Tyson, Jocko Willink) into an existing module, with journaling reflection prompts.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Ensure app is fully public-first with no sign-in/auth flows; create local-only device UUID profile on first launch; onboarding is local-only and non-blocking; data remains device-local; remove auth guards/protected routes and replace auth checks with useLocalProfile seam.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Redesign core user-facing readiness experience (daily dashboard/logging/coaching/visualization) to be interactive and game-like with real-time feedback, cause-and-effect readiness scoring (new transparent model), micro-interactions, and Field Mode as a global simplification toggle.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Gamify learning modules as missions (win conditions, XP rewards, rank/tier progression, unlockables, side quests, scenario-based/timed decisions, performance- and streak-based unlock progression).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Add Soldier Self-Awareness & Resilience module with placeholder assessments (OCEAN, MBTI, DISC, StrengthsFinder, GAT/resilience/EI), outcome-specific military-focused insights, local storage/trends, XP/badges, and mission unlocks tied to outcomes; include leader guidance.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Offline-first persistence uses localStorage namespaced by a device-scoped localUuid (profile, journals, daily inputs/readiness state, mission progression, assessment history).",
    "TanStack Router is used for public-first routing (no auth-gated routes); onboarding is a non-blocking overlay controlled by local flags.",
    "React Query is used for canister actor-backed queries/mutations; actor identity changes trigger cache invalidation/refetch.",
    "Clear separation between local-only hooks (useLocalProfile/useLocalData/useDashboard/useAssessments/useMissionProgression) and backend-dependent hooks (useQueries) with graceful fallbacks.",
    "Content-driven design: missions and assessments are defined as static content modules plus deterministic client-side scoring and rendering components.",
    "DFINITY integration via InternetIdentityProvider and actor creation utilities; anonymous actor is used when unauthenticated.",
    "UI stack: TailwindCSS + shadcn/ui components, lucide-react icons, next-themes for light/dark mode.",
    "“Field Mode” is a localStorage-backed global UI mode that increases tap targets and reduces visual noise via CSS class overrides.",
    "Motoko backend uses an authorization mixin (MixinAuthorization) and an AccessControl module to assign roles with an env-var admin token.",
    "Developer documentation exists in-code for the Assessments module (content/assessments/README.md) describing flows, scoring, and extension points."
  ],
  "known_issues": [
    "Groups are effectively non-functional: useGetMySquads() is hardcoded to return an empty array (commented as a stub).",
    "Backend canister (backend/main.mo) does not implement most group, journaling, reporting, or admin endpoints expected by the frontend, so many backend-dependent UI actions will be disabled or fail.",
    "Guidelines query has a local fallback, but useGetGuidelines() is disabled when actor is null (enabled requires actor), and Guidelines.tsx renders static text instead of using the fetched `guidelines` value.",
    "GroupSharedEntries.tsx attempts to match members to entries by comparing `member.joinedAt` (a timestamp) to `entry.author` (Principal); this type mismatch breaks author labeling/owner detection.",
    "Assessment reward persistence is inconsistent: AssessmentRun mutates `result.rewardGranted = true` after saving; the updated flag is not re-saved to local storage, and the computed `badgeName` is unused (no unlockable stored).",
    "useMissionProgression.applyMissionResult always adds XP and appends history; despite comments about deduplication, repeated runs (including assessments) can grant duplicate XP.",
    "Mission side-quest evaluation is simplified: all side quests complete when scorePercentage >= 80, ignoring each side quest’s declared condition; MissionRunner also keeps an unused sideQuestsCompleted state.",
    "DailyDashboard shows “syncing/queued” messaging when offline, but readiness logging is purely local and no sync queue or cloud merge exists.",
    "Backend readiness `getLastInput` returns the first entry in a Map iterator (not necessarily the latest), and backend state is in-memory (no stable persistence across upgrades).",
    "Access gating regression: invite-code/sign-in flow can block app from opening/previewing; must be removed/disabled to satisfy public-first, no-auth requirement."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "DAGGER - Holistic Health and Fitness",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}